; ModuleID = '/home/xxx/project/paper7/dataset/10_0_0/test/npb-v0/npb-v0_2_temp.bc'
source_filename = "/home/cec/src/install/EP/CMakeFiles/EP.dir/src/ep.bc"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

@main.dum = private unnamed_addr constant [3 x double] [double 1.000000e+00, double 1.000000e+00, double 1.000000e+00], align 16
@.str = private unnamed_addr constant [11 x i8] c"timer.flag\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"%15.0lf\00", align 1
@.str.3 = private unnamed_addr constant [58 x i8] c"\0A\0A NAS Parallel Benchmarks (NPB3.3-SER-C) - EP Benchmark\0A\00", align 1
@.str.4 = private unnamed_addr constant [44 x i8] c"\0A Number of random numbers generated: %15s\0A\00", align 1
@x = internal global [131072 x double] zeroinitializer, align 16, !dbg !0
@q = internal global [10 x double] zeroinitializer, align 16, !dbg !24
@.str.5 = private unnamed_addr constant [25 x i8] c"\0AEP Benchmark Results:\0A\0A\00", align 1
@.str.6 = private unnamed_addr constant [19 x i8] c"CPU Time =%10.4lf\0A\00", align 1
@.str.7 = private unnamed_addr constant [11 x i8] c"N = 2^%5d\0A\00", align 1
@.str.8 = private unnamed_addr constant [30 x i8] c"No. Gaussian Pairs = %15.0lf\0A\00", align 1
@.str.9 = private unnamed_addr constant [26 x i8] c"Sums = %25.15lE %25.15lE\0A\00", align 1

!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8388608, align: 64, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 131072, lowerBound: 0)
!24 = distinct !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!25 = !{i32 2, !"Dwarf Version", i32 4}
!26 = !{i32 2, !"Debug Info Version", i32 3}
!27 = !{!"clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)"}
!28 = distinct !DISubprogram(name: "main", scope: !16, file: !16, line: 72, type: !29, scopeLine: 73, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !32)
!29 = !DISubroutineType(types: !30)
!30 = !{!31}
!31 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!32 = !{}
!33 = !DILocalVariable(name: "Mops", scope: !28, file: !16, line: 74, type: !18)
!34 = !DILocation(line: 74, column: 10, scope: !28)
!35 = !DILocalVariable(name: "t1", scope: !28, file: !16, line: 74, type: !18)
!36 = !DILocation(line: 74, column: 16, scope: !28)
!37 = !DILocalVariable(name: "t2", scope: !28, file: !16, line: 74, type: !18)
!38 = !DILocation(line: 74, column: 20, scope: !28)
!39 = !DILocalVariable(name: "t3", scope: !28, file: !16, line: 74, type: !18)
!40 = !DILocation(line: 74, column: 24, scope: !28)
!41 = !DILocalVariable(name: "t4", scope: !28, file: !16, line: 74, type: !18)
!42 = !DILocation(line: 74, column: 28, scope: !28)
!43 = !DILocalVariable(name: "x1", scope: !28, file: !16, line: 74, type: !18)
!44 = !DILocation(line: 74, column: 32, scope: !28)
!45 = !DILocalVariable(name: "x2", scope: !28, file: !16, line: 74, type: !18)
!46 = !DILocation(line: 74, column: 36, scope: !28)
!47 = !DILocalVariable(name: "sx", scope: !28, file: !16, line: 75, type: !18)
!48 = !DILocation(line: 75, column: 10, scope: !28)
!49 = !DILocalVariable(name: "sy", scope: !28, file: !16, line: 75, type: !18)
!50 = !DILocation(line: 75, column: 14, scope: !28)
!51 = !DILocalVariable(name: "tm", scope: !28, file: !16, line: 75, type: !18)
!52 = !DILocation(line: 75, column: 18, scope: !28)
!53 = !DILocalVariable(name: "an", scope: !28, file: !16, line: 75, type: !18)
!54 = !DILocation(line: 75, column: 22, scope: !28)
!55 = !DILocalVariable(name: "tt", scope: !28, file: !16, line: 75, type: !18)
!56 = !DILocation(line: 75, column: 26, scope: !28)
!57 = !DILocalVariable(name: "gc", scope: !28, file: !16, line: 75, type: !18)
!58 = !DILocation(line: 75, column: 30, scope: !28)
!59 = !DILocalVariable(name: "sx_verify_value", scope: !28, file: !16, line: 76, type: !18)
!60 = !DILocation(line: 76, column: 10, scope: !28)
!61 = !DILocalVariable(name: "sy_verify_value", scope: !28, file: !16, line: 76, type: !18)
!62 = !DILocation(line: 76, column: 27, scope: !28)
!63 = !DILocalVariable(name: "sx_err", scope: !28, file: !16, line: 76, type: !18)
!64 = !DILocation(line: 76, column: 44, scope: !28)
!65 = !DILocalVariable(name: "sy_err", scope: !28, file: !16, line: 76, type: !18)
!66 = !DILocation(line: 76, column: 52, scope: !28)
!67 = !DILocalVariable(name: "np", scope: !28, file: !16, line: 77, type: !31)
!68 = !DILocation(line: 77, column: 7, scope: !28)
!69 = !DILocalVariable(name: "i", scope: !28, file: !16, line: 78, type: !31)
!70 = !DILocation(line: 78, column: 7, scope: !28)
!71 = !DILocalVariable(name: "ik", scope: !28, file: !16, line: 78, type: !31)
!72 = !DILocation(line: 78, column: 10, scope: !28)
!73 = !DILocalVariable(name: "kk", scope: !28, file: !16, line: 78, type: !31)
!74 = !DILocation(line: 78, column: 14, scope: !28)
!75 = !DILocalVariable(name: "l", scope: !28, file: !16, line: 78, type: !31)
!76 = !DILocation(line: 78, column: 18, scope: !28)
!77 = !DILocalVariable(name: "k", scope: !28, file: !16, line: 78, type: !31)
!78 = !DILocation(line: 78, column: 21, scope: !28)
!79 = !DILocalVariable(name: "nit", scope: !28, file: !16, line: 78, type: !31)
!80 = !DILocation(line: 78, column: 24, scope: !28)
!81 = !DILocalVariable(name: "k_offset", scope: !28, file: !16, line: 79, type: !31)
!82 = !DILocation(line: 79, column: 7, scope: !28)
!83 = !DILocalVariable(name: "j", scope: !28, file: !16, line: 79, type: !31)
!84 = !DILocation(line: 79, column: 17, scope: !28)
!85 = !DILocalVariable(name: "verified", scope: !28, file: !16, line: 80, type: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "logical", file: !6, line: 4, baseType: !5)
!87 = !DILocation(line: 80, column: 11, scope: !28)
!88 = !DILocalVariable(name: "timers_enabled", scope: !28, file: !16, line: 80, type: !86)
!89 = !DILocation(line: 80, column: 21, scope: !28)
!90 = !DILocalVariable(name: "dum", scope: !28, file: !16, line: 82, type: !91)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 192, align: 64, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 3, lowerBound: 0)
!94 = !DILocation(line: 82, column: 10, scope: !28)
!95 = !DILocalVariable(name: "size", scope: !28, file: !16, line: 83, type: !96)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 128, align: 8, elements: !98)
!97 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!98 = !{!99}
!99 = !DISubrange(count: 16, lowerBound: 0)
!100 = !DILocation(line: 83, column: 8, scope: !28)
!101 = !DILocalVariable(name: "fp", scope: !28, file: !16, line: 85, type: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !104, line: 48, baseType: !105)
!104 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/cec/src/install")
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !106, line: 241, size: 1728, align: 64, elements: !107)
!106 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/cec/src/install")
!107 = !{!108, !109, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !129, !130, !131, !132, !136, !138, !140, !144, !147, !149, !150, !151, !152, !153, !157, !158}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !105, file: !106, line: 242, baseType: !31, size: 32, align: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !105, file: !106, line: 247, baseType: !110, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !105, file: !106, line: 248, baseType: !110, size: 64, align: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !105, file: !106, line: 249, baseType: !110, size: 64, align: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !105, file: !106, line: 250, baseType: !110, size: 64, align: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !105, file: !106, line: 251, baseType: !110, size: 64, align: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !105, file: !106, line: 252, baseType: !110, size: 64, align: 64, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !105, file: !106, line: 253, baseType: !110, size: 64, align: 64, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !105, file: !106, line: 254, baseType: !110, size: 64, align: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !105, file: !106, line: 256, baseType: !110, size: 64, align: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !105, file: !106, line: 257, baseType: !110, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !105, file: !106, line: 258, baseType: !110, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !105, file: !106, line: 260, baseType: !122, size: 64, align: 64, offset: 768)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !106, line: 156, size: 192, align: 64, elements: !124)
!124 = !{!125, !126, !128}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !123, file: !106, line: 157, baseType: !122, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !123, file: !106, line: 158, baseType: !127, size: 64, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !123, file: !106, line: 162, baseType: !31, size: 32, align: 32, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !105, file: !106, line: 262, baseType: !127, size: 64, align: 64, offset: 832)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !105, file: !106, line: 264, baseType: !31, size: 32, align: 32, offset: 896)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !105, file: !106, line: 268, baseType: !31, size: 32, align: 32, offset: 928)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !105, file: !106, line: 270, baseType: !133, size: 64, align: 64, offset: 960)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !134, line: 131, baseType: !135)
!134 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/cec/src/install")
!135 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !105, file: !106, line: 274, baseType: !137, size: 16, align: 16, offset: 1024)
!137 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !105, file: !106, line: 275, baseType: !139, size: 8, align: 8, offset: 1040)
!139 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !105, file: !106, line: 276, baseType: !141, size: 8, align: 8, offset: 1048)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 8, align: 8, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 1, lowerBound: 0)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !105, file: !106, line: 280, baseType: !145, size: 64, align: 64, offset: 1088)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !106, line: 150, baseType: null)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !105, file: !106, line: 289, baseType: !148, size: 64, align: 64, offset: 1152)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !134, line: 132, baseType: !135)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !105, file: !106, line: 297, baseType: !11, size: 64, align: 64, offset: 1216)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !105, file: !106, line: 298, baseType: !11, size: 64, align: 64, offset: 1280)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !105, file: !106, line: 299, baseType: !11, size: 64, align: 64, offset: 1344)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !105, file: !106, line: 300, baseType: !11, size: 64, align: 64, offset: 1408)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !105, file: !106, line: 302, baseType: !154, size: 64, align: 64, offset: 1472)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !155, line: 62, baseType: !156)
!155 = !DIFile(filename: "/usr/lib/llvm-3.8/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/home/cec/src/install")
!156 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !105, file: !106, line: 303, baseType: !31, size: 32, align: 32, offset: 1536)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !105, file: !106, line: 305, baseType: !159, size: 160, align: 8, offset: 1568)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 160, align: 8, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 20, lowerBound: 0)
!162 = !DILocation(line: 85, column: 9, scope: !28)
!163 = !DILocation(line: 87, column: 13, scope: !164)
!164 = distinct !DILexicalBlock(scope: !28, file: !16, line: 87, column: 7)
!165 = !DILocation(line: 87, column: 11, scope: !164)
!166 = !DILocation(line: 87, column: 39, scope: !164)
!167 = !DILocation(line: 87, column: 7, scope: !28)
!168 = !DILocation(line: 88, column: 20, scope: !169)
!169 = distinct !DILexicalBlock(scope: !164, file: !16, line: 87, column: 54)
!170 = !DILocation(line: 89, column: 3, scope: !169)
!171 = !DILocation(line: 90, column: 20, scope: !172)
!172 = distinct !DILexicalBlock(scope: !164, file: !16, line: 89, column: 10)
!173 = !DILocation(line: 91, column: 12, scope: !172)
!174 = !DILocation(line: 91, column: 5, scope: !172)
!175 = !DILocation(line: 101, column: 11, scope: !28)
!176 = !DILocation(line: 101, column: 28, scope: !28)
!177 = !DILocation(line: 101, column: 3, scope: !28)
!178 = !DILocation(line: 102, column: 5, scope: !28)
!179 = !DILocation(line: 103, column: 12, scope: !180)
!180 = distinct !DILexicalBlock(scope: !28, file: !16, line: 103, column: 7)
!181 = !DILocation(line: 103, column: 7, scope: !180)
!182 = !DILocation(line: 103, column: 15, scope: !180)
!183 = !DILocation(line: 103, column: 7, scope: !28)
!184 = !DILocation(line: 103, column: 24, scope: !180)
!185 = !DILocation(line: 103, column: 23, scope: !180)
!186 = !DILocation(line: 104, column: 8, scope: !28)
!187 = !DILocation(line: 104, column: 9, scope: !28)
!188 = !DILocation(line: 104, column: 3, scope: !28)
!189 = !DILocation(line: 104, column: 13, scope: !28)
!190 = !DILocation(line: 105, column: 3, scope: !28)
!191 = !DILocation(line: 106, column: 59, scope: !28)
!192 = !DILocation(line: 106, column: 3, scope: !28)
!193 = !DILocation(line: 108, column: 12, scope: !28)
!194 = !DILocation(line: 116, column: 6, scope: !28)
!195 = !DILocation(line: 125, column: 14, scope: !28)
!196 = !DILocation(line: 125, column: 22, scope: !28)
!197 = !DILocation(line: 125, column: 31, scope: !28)
!198 = !DILocation(line: 125, column: 3, scope: !28)
!199 = !DILocation(line: 126, column: 20, scope: !28)
!200 = !DILocation(line: 126, column: 28, scope: !28)
!201 = !DILocation(line: 126, column: 12, scope: !28)
!202 = !DILocation(line: 126, column: 3, scope: !28)
!203 = !DILocation(line: 126, column: 10, scope: !28)
!204 = !DILocation(line: 127, column: 10, scope: !205)
!205 = distinct !DILexicalBlock(scope: !28, file: !16, line: 127, column: 3)
!206 = !DILocation(line: 127, column: 8, scope: !205)
!207 = !DILocation(line: 127, column: 15, scope: !208)
!208 = distinct !DILexicalBlock(scope: !205, file: !16, line: 127, column: 3)
!209 = !DILocation(line: 127, column: 17, scope: !208)
!210 = !DILocation(line: 127, column: 3, scope: !205)
!211 = !DILocation(line: 128, column: 7, scope: !212)
!212 = distinct !DILexicalBlock(scope: !208, file: !16, line: 127, column: 39)
!213 = !DILocation(line: 128, column: 5, scope: !212)
!214 = !DILocation(line: 128, column: 10, scope: !212)
!215 = !DILocation(line: 129, column: 3, scope: !212)
!216 = !DILocation(line: 127, column: 35, scope: !208)
!217 = !DILocation(line: 127, column: 3, scope: !208)
!218 = !DILocation(line: 130, column: 19, scope: !28)
!219 = !DILocation(line: 130, column: 14, scope: !28)
!220 = !DILocation(line: 130, column: 10, scope: !28)
!221 = !DILocation(line: 130, column: 8, scope: !28)
!222 = !DILocation(line: 132, column: 3, scope: !28)
!223 = !DILocation(line: 133, column: 3, scope: !28)
!224 = !DILocation(line: 134, column: 3, scope: !28)
!225 = !DILocation(line: 135, column: 3, scope: !28)
!226 = !DILocation(line: 137, column: 6, scope: !28)
!227 = !DILocation(line: 138, column: 3, scope: !28)
