; ModuleID = '/home/xxx/project/paper7/dataset/10_0_0/test/npb-v0/npb-v0_44_temp.bc'
source_filename = "/home/cec/src/install/LU/CMakeFiles/LU.dir/src/read_input.bc"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

@.str = private unnamed_addr constant [59 x i8] c"\0A\0A NAS Parallel Benchmarks (NPB3.3-SER-C) - LU Benchmark\0A\0A\00", align 1
@.str.1 = private unnamed_addr constant [13 x i8] c"inputlu.data\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.3 = private unnamed_addr constant [38 x i8] c"Reading from input file inputlu.data\0A\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"%d%d\00", align 1
@ipr = external global i32, align 4
@inorm = external global i32, align 4
@.str.5 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@itmax = external global i32, align 4
@.str.6 = private unnamed_addr constant [4 x i8] c"%lf\00", align 1
@dt = external global double, align 8
@omega = external global double, align 8
@.str.7 = private unnamed_addr constant [16 x i8] c"%lf%lf%lf%lf%lf\00", align 1
@tolrsd = external global [5 x double], align 16
@.str.8 = private unnamed_addr constant [7 x i8] c"%d%d%d\00", align 1
@nx0 = external global i32, align 4
@ny0 = external global i32, align 4
@nz0 = external global i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "LU/CMakeFiles/LU.dir/src/read_input.c", directory: "/home/cec/src/install")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{!"clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)"}
!8 = distinct !DISubprogram(name: "read_input", scope: !9, file: !9, line: 38, type: !10, scopeLine: 39, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!9 = !DIFile(filename: "/home/cec/src/nauseous/LU/src/read_input.c", directory: "/home/cec/src/install")
!10 = !DISubroutineType(types: !11)
!11 = !{null}
!12 = !DILocalVariable(name: "fp", scope: !8, file: !9, line: 40, type: !13)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !15, line: 48, baseType: !16)
!15 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/cec/src/install")
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !17, line: 241, size: 1728, align: 64, elements: !18)
!17 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/cec/src/install")
!18 = !{!19, !21, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !42, !43, !44, !45, !49, !51, !53, !57, !60, !62, !63, !64, !65, !66, !70, !71}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !16, file: !17, line: 242, baseType: !20, size: 32, align: 32)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !16, file: !17, line: 247, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !16, file: !17, line: 248, baseType: !22, size: 64, align: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !16, file: !17, line: 249, baseType: !22, size: 64, align: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !16, file: !17, line: 250, baseType: !22, size: 64, align: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !16, file: !17, line: 251, baseType: !22, size: 64, align: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !16, file: !17, line: 252, baseType: !22, size: 64, align: 64, offset: 384)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !16, file: !17, line: 253, baseType: !22, size: 64, align: 64, offset: 448)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !16, file: !17, line: 254, baseType: !22, size: 64, align: 64, offset: 512)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !16, file: !17, line: 256, baseType: !22, size: 64, align: 64, offset: 576)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !16, file: !17, line: 257, baseType: !22, size: 64, align: 64, offset: 640)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !16, file: !17, line: 258, baseType: !22, size: 64, align: 64, offset: 704)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !16, file: !17, line: 260, baseType: !35, size: 64, align: 64, offset: 768)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !17, line: 156, size: 192, align: 64, elements: !37)
!37 = !{!38, !39, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !36, file: !17, line: 157, baseType: !35, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !36, file: !17, line: 158, baseType: !40, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !36, file: !17, line: 162, baseType: !20, size: 32, align: 32, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !16, file: !17, line: 262, baseType: !40, size: 64, align: 64, offset: 832)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !16, file: !17, line: 264, baseType: !20, size: 32, align: 32, offset: 896)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !16, file: !17, line: 268, baseType: !20, size: 32, align: 32, offset: 928)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !16, file: !17, line: 270, baseType: !46, size: 64, align: 64, offset: 960)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !47, line: 131, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/cec/src/install")
!48 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !16, file: !17, line: 274, baseType: !50, size: 16, align: 16, offset: 1024)
!50 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !16, file: !17, line: 275, baseType: !52, size: 8, align: 8, offset: 1040)
!52 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !16, file: !17, line: 276, baseType: !54, size: 8, align: 8, offset: 1048)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, align: 8, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 1, lowerBound: 0)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !16, file: !17, line: 280, baseType: !58, size: 64, align: 64, offset: 1088)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !17, line: 150, baseType: null)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !16, file: !17, line: 289, baseType: !61, size: 64, align: 64, offset: 1152)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !47, line: 132, baseType: !48)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !16, file: !17, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !16, file: !17, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !16, file: !17, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !16, file: !17, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !16, file: !17, line: 302, baseType: !67, size: 64, align: 64, offset: 1472)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !68, line: 62, baseType: !69)
!68 = !DIFile(filename: "/usr/lib/llvm-3.8/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/home/cec/src/install")
!69 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !16, file: !17, line: 303, baseType: !20, size: 32, align: 32, offset: 1536)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !16, file: !17, line: 305, baseType: !72, size: 160, align: 8, offset: 1568)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, align: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 20, lowerBound: 0)
!75 = !DILocation(line: 40, column: 9, scope: !8)
!76 = !DILocalVariable(name: "result", scope: !8, file: !9, line: 41, type: !20)
!77 = !DILocation(line: 41, column: 7, scope: !8)
!78 = !DILocation(line: 54, column: 3, scope: !8)
!79 = !DILocation(line: 56, column: 13, scope: !80)
!80 = distinct !DILexicalBlock(scope: !8, file: !9, line: 56, column: 7)
!81 = !DILocation(line: 56, column: 11, scope: !80)
!82 = !DILocation(line: 56, column: 41, scope: !80)
!83 = !DILocation(line: 56, column: 7, scope: !8)
!84 = !DILocation(line: 57, column: 5, scope: !85)
!85 = distinct !DILexicalBlock(scope: !80, file: !9, line: 56, column: 56)
!86 = !DILocation(line: 59, column: 5, scope: !85)
!87 = !DILocation(line: 59, column: 18, scope: !85)
!88 = !DILocation(line: 59, column: 12, scope: !85)
!89 = !DILocation(line: 59, column: 22, scope: !85)
!90 = !DILocation(line: 60, column: 5, scope: !85)
!91 = !DILocation(line: 60, column: 18, scope: !85)
!92 = !DILocation(line: 60, column: 12, scope: !85)
!93 = !DILocation(line: 60, column: 22, scope: !85)
!94 = !DILocation(line: 61, column: 21, scope: !85)
!95 = !DILocation(line: 61, column: 14, scope: !85)
!96 = !DILocation(line: 61, column: 12, scope: !85)
!97 = !DILocation(line: 62, column: 5, scope: !85)
!98 = !DILocation(line: 62, column: 18, scope: !85)
!99 = !DILocation(line: 62, column: 12, scope: !85)
!100 = !DILocation(line: 62, column: 22, scope: !85)
!101 = !DILocation(line: 64, column: 5, scope: !85)
!102 = !DILocation(line: 64, column: 18, scope: !85)
!103 = !DILocation(line: 64, column: 12, scope: !85)
!104 = !DILocation(line: 64, column: 22, scope: !85)
!105 = !DILocation(line: 65, column: 5, scope: !85)
!106 = !DILocation(line: 65, column: 18, scope: !85)
!107 = !DILocation(line: 65, column: 12, scope: !85)
!108 = !DILocation(line: 65, column: 22, scope: !85)
!109 = !DILocation(line: 66, column: 21, scope: !85)
!110 = !DILocation(line: 66, column: 14, scope: !85)
!111 = !DILocation(line: 66, column: 12, scope: !85)
!112 = !DILocation(line: 67, column: 5, scope: !85)
!113 = !DILocation(line: 67, column: 18, scope: !85)
!114 = !DILocation(line: 67, column: 12, scope: !85)
!115 = !DILocation(line: 67, column: 22, scope: !85)
!116 = !DILocation(line: 69, column: 5, scope: !85)
!117 = !DILocation(line: 69, column: 18, scope: !85)
!118 = !DILocation(line: 69, column: 12, scope: !85)
!119 = !DILocation(line: 69, column: 22, scope: !85)
!120 = !DILocation(line: 70, column: 5, scope: !85)
!121 = !DILocation(line: 70, column: 18, scope: !85)
!122 = !DILocation(line: 70, column: 12, scope: !85)
!123 = !DILocation(line: 70, column: 22, scope: !85)
!124 = !DILocation(line: 71, column: 21, scope: !85)
!125 = !DILocation(line: 71, column: 14, scope: !85)
!126 = !DILocation(line: 71, column: 12, scope: !85)
!127 = !DILocation(line: 72, column: 5, scope: !85)
!128 = !DILocation(line: 72, column: 18, scope: !85)
!129 = !DILocation(line: 72, column: 12, scope: !85)
!130 = !DILocation(line: 72, column: 22, scope: !85)
!131 = !DILocation(line: 74, column: 5, scope: !85)
!132 = !DILocation(line: 74, column: 18, scope: !85)
!133 = !DILocation(line: 74, column: 12, scope: !85)
!134 = !DILocation(line: 74, column: 22, scope: !85)
!135 = !DILocation(line: 75, column: 5, scope: !85)
!136 = !DILocation(line: 75, column: 18, scope: !85)
!137 = !DILocation(line: 75, column: 12, scope: !85)
!138 = !DILocation(line: 75, column: 22, scope: !85)
!139 = !DILocation(line: 76, column: 21, scope: !85)
!140 = !DILocation(line: 76, column: 14, scope: !85)
!141 = !DILocation(line: 76, column: 12, scope: !85)
!142 = !DILocation(line: 77, column: 5, scope: !85)
!143 = !DILocation(line: 77, column: 18, scope: !85)
