; ModuleID = '/home/xxx/project/paper7/dataset/10_0_0/test/npb-v0/npb-v0_121_temp.bc'
source_filename = "/home/cec/src/install/MG/CMakeFiles/MG.dir/src/mg.bc"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

@.str = private unnamed_addr constant [11 x i8] c"timer.flag\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@timeron = internal global i32 0, align 4, !dbg !0
@.str.2 = private unnamed_addr constant [5 x i8] c"init\00", align 1
@.str.3 = private unnamed_addr constant [8 x i8] c"benchmk\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"mg3P\00", align 1
@.str.5 = private unnamed_addr constant [6 x i8] c"psinv\00", align 1
@.str.6 = private unnamed_addr constant [6 x i8] c"resid\00", align 1
@.str.7 = private unnamed_addr constant [6 x i8] c"rprj3\00", align 1
@.str.8 = private unnamed_addr constant [7 x i8] c"interp\00", align 1
@.str.9 = private unnamed_addr constant [6 x i8] c"norm2\00", align 1
@.str.10 = private unnamed_addr constant [6 x i8] c"comm3\00", align 1
@.str.11 = private unnamed_addr constant [59 x i8] c"\0A\0A NAS Parallel Benchmarks (NPB3.3-SER-C) - MG Benchmark\0A\0A\00", align 1
@.str.12 = private unnamed_addr constant [9 x i8] c"mg.input\00", align 1
@.str.13 = private unnamed_addr constant [35 x i8] c" Reading from input file mg.input\0A\00", align 1

!87 = distinct !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!88 = distinct !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!89 = distinct !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!90 = distinct !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!91 = distinct !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!92 = distinct !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!93 = !{i32 2, !"Dwarf Version", i32 4}
!94 = !{i32 2, !"Debug Info Version", i32 3}
!95 = !{!"clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)"}
!96 = distinct !DISubprogram(name: "main", scope: !44, file: !44, line: 86, type: !97, scopeLine: 87, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !99)
!97 = !DISubroutineType(types: !98)
!98 = !{!22}
!99 = !{}
!100 = !DILocalVariable(name: "k", scope: !96, file: !44, line: 92, type: !22)
!101 = !DILocation(line: 92, column: 7, scope: !96)
!102 = !DILocalVariable(name: "it", scope: !96, file: !44, line: 92, type: !22)
!103 = !DILocation(line: 92, column: 10, scope: !96)
!104 = !DILocalVariable(name: "t", scope: !96, file: !44, line: 93, type: !14)
!105 = !DILocation(line: 93, column: 10, scope: !96)
!106 = !DILocalVariable(name: "tinit", scope: !96, file: !44, line: 93, type: !14)
!107 = !DILocation(line: 93, column: 13, scope: !96)
!108 = !DILocalVariable(name: "mflops", scope: !96, file: !44, line: 93, type: !14)
!109 = !DILocation(line: 93, column: 20, scope: !96)
!110 = !DILocalVariable(name: "a", scope: !96, file: !44, line: 95, type: !111)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, align: 64, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 4, lowerBound: 0)
!114 = !DILocation(line: 95, column: 10, scope: !96)
!115 = !DILocalVariable(name: "c", scope: !96, file: !44, line: 95, type: !111)
!116 = !DILocation(line: 95, column: 16, scope: !96)
!117 = !DILocalVariable(name: "rnm2", scope: !96, file: !44, line: 97, type: !14)
!118 = !DILocation(line: 97, column: 10, scope: !96)
!119 = !DILocalVariable(name: "rnmu", scope: !96, file: !44, line: 97, type: !14)
!120 = !DILocation(line: 97, column: 16, scope: !96)
!121 = !DILocalVariable(name: "old2", scope: !96, file: !44, line: 97, type: !14)
!122 = !DILocation(line: 97, column: 22, scope: !96)
!123 = !DILocalVariable(name: "oldu", scope: !96, file: !44, line: 97, type: !14)
!124 = !DILocation(line: 97, column: 28, scope: !96)
!125 = !DILocalVariable(name: "epsilon", scope: !96, file: !44, line: 97, type: !14)
!126 = !DILocation(line: 97, column: 34, scope: !96)
!127 = !DILocalVariable(name: "n1", scope: !96, file: !44, line: 98, type: !22)
!128 = !DILocation(line: 98, column: 7, scope: !96)
!129 = !DILocalVariable(name: "n2", scope: !96, file: !44, line: 98, type: !22)
!130 = !DILocation(line: 98, column: 11, scope: !96)
!131 = !DILocalVariable(name: "n3", scope: !96, file: !44, line: 98, type: !22)
!132 = !DILocation(line: 98, column: 15, scope: !96)
!133 = !DILocalVariable(name: "nit", scope: !96, file: !44, line: 98, type: !22)
!134 = !DILocation(line: 98, column: 19, scope: !96)
!135 = !DILocalVariable(name: "nn", scope: !96, file: !44, line: 99, type: !14)
!136 = !DILocation(line: 99, column: 10, scope: !96)
!137 = !DILocalVariable(name: "verify_value", scope: !96, file: !44, line: 99, type: !14)
!138 = !DILocation(line: 99, column: 14, scope: !96)
!139 = !DILocalVariable(name: "err", scope: !96, file: !44, line: 99, type: !14)
!140 = !DILocation(line: 99, column: 28, scope: !96)
!141 = !DILocalVariable(name: "verified", scope: !96, file: !44, line: 100, type: !72)
!142 = !DILocation(line: 100, column: 11, scope: !96)
!143 = !DILocalVariable(name: "i", scope: !96, file: !44, line: 102, type: !22)
!144 = !DILocation(line: 102, column: 7, scope: !96)
!145 = !DILocalVariable(name: "t_names", scope: !96, file: !44, line: 103, type: !146)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 640, align: 64, elements: !148)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!148 = !{!149}
!149 = !DISubrange(count: 10, lowerBound: 0)
!150 = !DILocation(line: 103, column: 9, scope: !96)
!151 = !DILocalVariable(name: "tmax", scope: !96, file: !44, line: 104, type: !14)
!152 = !DILocation(line: 104, column: 10, scope: !96)
!153 = !DILocation(line: 106, column: 10, scope: !154)
!154 = distinct !DILexicalBlock(scope: !96, file: !44, line: 106, column: 3)
!155 = !DILocation(line: 106, column: 8, scope: !154)
!156 = !DILocation(line: 106, column: 15, scope: !157)
!157 = distinct !DILexicalBlock(scope: !154, file: !44, line: 106, column: 3)
!158 = !DILocation(line: 106, column: 17, scope: !157)
!159 = !DILocation(line: 106, column: 3, scope: !154)
!160 = !DILocation(line: 107, column: 17, scope: !161)
!161 = distinct !DILexicalBlock(scope: !157, file: !44, line: 106, column: 28)
!162 = !DILocation(line: 107, column: 5, scope: !161)
!163 = !DILocation(line: 108, column: 3, scope: !161)
!164 = !DILocation(line: 106, column: 24, scope: !157)
!165 = !DILocation(line: 106, column: 3, scope: !157)
!166 = !DILocation(line: 110, column: 3, scope: !96)
!167 = !DILocalVariable(name: "fp", scope: !96, file: !44, line: 115, type: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !170, line: 48, baseType: !171)
!170 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/cec/src/install")
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !172, line: 241, size: 1728, align: 64, elements: !173)
!172 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/cec/src/install")
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !194, !195, !196, !197, !201, !203, !205, !209, !212, !214, !215, !216, !217, !218, !222, !223}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !171, file: !172, line: 242, baseType: !22, size: 32, align: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !171, file: !172, line: 247, baseType: !147, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !171, file: !172, line: 248, baseType: !147, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !171, file: !172, line: 249, baseType: !147, size: 64, align: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !171, file: !172, line: 250, baseType: !147, size: 64, align: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !171, file: !172, line: 251, baseType: !147, size: 64, align: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !171, file: !172, line: 252, baseType: !147, size: 64, align: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !171, file: !172, line: 253, baseType: !147, size: 64, align: 64, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !171, file: !172, line: 254, baseType: !147, size: 64, align: 64, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !171, file: !172, line: 256, baseType: !147, size: 64, align: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !171, file: !172, line: 257, baseType: !147, size: 64, align: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !171, file: !172, line: 258, baseType: !147, size: 64, align: 64, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !171, file: !172, line: 260, baseType: !187, size: 64, align: 64, offset: 768)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !172, line: 156, size: 192, align: 64, elements: !189)
!189 = !{!190, !191, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !188, file: !172, line: 157, baseType: !187, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !188, file: !172, line: 158, baseType: !192, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !188, file: !172, line: 162, baseType: !22, size: 32, align: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !171, file: !172, line: 262, baseType: !192, size: 64, align: 64, offset: 832)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !171, file: !172, line: 264, baseType: !22, size: 32, align: 32, offset: 896)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !171, file: !172, line: 268, baseType: !22, size: 32, align: 32, offset: 928)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !171, file: !172, line: 270, baseType: !198, size: 64, align: 64, offset: 960)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !199, line: 131, baseType: !200)
!199 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/cec/src/install")
!200 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !171, file: !172, line: 274, baseType: !202, size: 16, align: 16, offset: 1024)
!202 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !171, file: !172, line: 275, baseType: !204, size: 8, align: 8, offset: 1040)
!204 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !171, file: !172, line: 276, baseType: !206, size: 8, align: 8, offset: 1048)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 1, lowerBound: 0)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !171, file: !172, line: 280, baseType: !210, size: 64, align: 64, offset: 1088)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !172, line: 150, baseType: null)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !171, file: !172, line: 289, baseType: !213, size: 64, align: 64, offset: 1152)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !199, line: 132, baseType: !200)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !171, file: !172, line: 297, baseType: !11, size: 64, align: 64, offset: 1216)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !171, file: !172, line: 298, baseType: !11, size: 64, align: 64, offset: 1280)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !171, file: !172, line: 299, baseType: !11, size: 64, align: 64, offset: 1344)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !171, file: !172, line: 300, baseType: !11, size: 64, align: 64, offset: 1408)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !171, file: !172, line: 302, baseType: !219, size: 64, align: 64, offset: 1472)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !220, line: 62, baseType: !221)
!220 = !DIFile(filename: "/usr/lib/llvm-3.8/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/home/cec/src/install")
!221 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !171, file: !172, line: 303, baseType: !22, size: 32, align: 32, offset: 1536)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !171, file: !172, line: 305, baseType: !224, size: 160, align: 8, offset: 1568)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 20, lowerBound: 0)
!227 = !DILocation(line: 115, column: 9, scope: !96)
!228 = !DILocation(line: 116, column: 13, scope: !229)
!229 = distinct !DILexicalBlock(scope: !96, file: !44, line: 116, column: 7)
!230 = !DILocation(line: 116, column: 11, scope: !229)
!231 = !DILocation(line: 116, column: 39, scope: !229)
!232 = !DILocation(line: 116, column: 7, scope: !96)
!233 = !DILocation(line: 117, column: 13, scope: !234)
!234 = distinct !DILexicalBlock(scope: !229, file: !44, line: 116, column: 54)
!235 = !DILocation(line: 118, column: 5, scope: !234)
!236 = !DILocation(line: 118, column: 16, scope: !234)
!237 = !DILocation(line: 119, column: 5, scope: !234)
!238 = !DILocation(line: 119, column: 16, scope: !234)
!239 = !DILocation(line: 120, column: 5, scope: !234)
!240 = !DILocation(line: 120, column: 16, scope: !234)
!241 = !DILocation(line: 121, column: 5, scope: !234)
!242 = !DILocation(line: 121, column: 16, scope: !234)
!243 = !DILocation(line: 122, column: 5, scope: !234)
!244 = !DILocation(line: 122, column: 16, scope: !234)
!245 = !DILocation(line: 123, column: 5, scope: !234)
!246 = !DILocation(line: 123, column: 16, scope: !234)
!247 = !DILocation(line: 124, column: 5, scope: !234)
!248 = !DILocation(line: 124, column: 16, scope: !234)
!249 = !DILocation(line: 125, column: 5, scope: !234)
!250 = !DILocation(line: 125, column: 16, scope: !234)
!251 = !DILocation(line: 126, column: 5, scope: !234)
!252 = !DILocation(line: 126, column: 16, scope: !234)
!253 = !DILocation(line: 127, column: 12, scope: !234)
!254 = !DILocation(line: 127, column: 5, scope: !234)
!255 = !DILocation(line: 128, column: 3, scope: !234)
!256 = !DILocation(line: 129, column: 13, scope: !257)
!257 = distinct !DILexicalBlock(scope: !229, file: !44, line: 128, column: 10)
!258 = !DILocation(line: 132, column: 3, scope: !96)
!259 = !DILocation(line: 134, column: 13, scope: !260)
!260 = distinct !DILexicalBlock(scope: !96, file: !44, line: 134, column: 7)
!261 = !DILocation(line: 134, column: 11, scope: !260)
!262 = !DILocation(line: 134, column: 37, scope: !260)
!263 = !DILocation(line: 134, column: 7, scope: !96)
!264 = !DILocalVariable(name: "result", scope: !265, file: !44, line: 135, type: !22)
!265 = distinct !DILexicalBlock(scope: !260, file: !44, line: 134, column: 52)
!266 = !DILocation(line: 135, column: 9, scope: !265)
!267 = !DILocation(line: 136, column: 5, scope: !265)
!268 = !DILocation(line: 137, column: 21, scope: !265)
!269 = !DILocation(line: 137, column: 14, scope: !265)
!270 = !DILocation(line: 137, column: 12, scope: !265)
!271 = !DILocation(line: 138, column: 5, scope: !265)
!272 = !DILocation(line: 138, column: 18, scope: !265)
!273 = !DILocation(line: 138, column: 12, scope: !265)
!274 = !DILocation(line: 138, column: 22, scope: !265)
!275 = !DILocation(line: 139, column: 21, scope: !265)
!276 = !DILocation(line: 139, column: 39, scope: !265)
!277 = !DILocation(line: 139, column: 36, scope: !265)
!278 = !DILocation(line: 139, column: 48, scope: !265)
!279 = !DILocation(line: 139, column: 45, scope: !265)
!280 = !DILocation(line: 139, column: 57, scope: !265)
!281 = !DILocation(line: 139, column: 54, scope: !265)
!282 = !DILocation(line: 139, column: 14, scope: !265)
!283 = !DILocation(line: 139, column: 12, scope: !265)
!284 = !DILocation(line: 140, column: 5, scope: !265)
!285 = !DILocation(line: 140, column: 18, scope: !265)
!286 = !DILocation(line: 140, column: 12, scope: !265)
!287 = !DILocation(line: 140, column: 22, scope: !265)
!288 = !DILocation(line: 141, column: 21, scope: !265)
!289 = !DILocation(line: 141, column: 14, scope: !265)
!290 = !DILocation(line: 141, column: 12, scope: !265)
!291 = !DILocation(line: 142, column: 5, scope: !265)
