; ModuleID = '/home/haolin/project/paper7/dataset/10_0_0/test/npb-v0/npb-v0_43_temp.bc'
source_filename = "/home/cec/src/install/LU/CMakeFiles/LU.dir/src/lu.bc"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

@.str = private unnamed_addr constant [11 x i8] c"timer.flag\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@timeron = common global i32 0, align 4, !dbg !0
@.str.2 = private unnamed_addr constant [6 x i8] c"total\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"rhsx\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"rhsy\00", align 1
@.str.5 = private unnamed_addr constant [5 x i8] c"rhsz\00", align 1
@.str.6 = private unnamed_addr constant [4 x i8] c"rhs\00", align 1
@.str.7 = private unnamed_addr constant [6 x i8] c"jacld\00", align 1
@.str.8 = private unnamed_addr constant [5 x i8] c"blts\00", align 1
@.str.9 = private unnamed_addr constant [5 x i8] c"jacu\00", align 1
@.str.10 = private unnamed_addr constant [5 x i8] c"buts\00", align 1
@.str.11 = private unnamed_addr constant [4 x i8] c"add\00", align 1
@.str.12 = private unnamed_addr constant [7 x i8] c"l2norm\00", align 1
@itmax = common global i32 0, align 4, !dbg !168
@rsdnm = common global [5 x double] zeroinitializer, align 16, !dbg !169
@errnm = common global [5 x double] zeroinitializer, align 16, !dbg !170

!199 = distinct !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!200 = distinct !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!201 = distinct !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!202 = distinct !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!203 = distinct !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!204 = distinct !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!205 = distinct !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!206 = distinct !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!207 = distinct !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!208 = distinct !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!209 = distinct !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!210 = distinct !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!211 = distinct !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!212 = distinct !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!213 = distinct !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!214 = distinct !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!215 = distinct !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!216 = distinct !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!217 = distinct !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!218 = distinct !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!219 = distinct !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!220 = distinct !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!221 = distinct !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!222 = distinct !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!223 = distinct !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!224 = distinct !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!225 = distinct !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!226 = distinct !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!227 = distinct !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!228 = distinct !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!229 = distinct !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!230 = distinct !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!231 = distinct !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!232 = distinct !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!233 = distinct !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!234 = distinct !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!235 = !{i32 2, !"Dwarf Version", i32 4}
!236 = !{i32 2, !"Debug Info Version", i32 3}
!237 = !{!"clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)"}
!238 = distinct !DISubprogram(name: "main", scope: !16, file: !16, line: 129, type: !239, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !244)
!239 = !DISubroutineType(types: !240)
!240 = !{!41, !41, !241}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!244 = !{}
!245 = !DILocalVariable(name: "argc", arg: 1, scope: !238, file: !16, line: 129, type: !41)
!246 = !DILocation(line: 129, column: 14, scope: !238)
!247 = !DILocalVariable(name: "argv", arg: 2, scope: !238, file: !16, line: 129, type: !241)
!248 = !DILocation(line: 129, column: 26, scope: !238)
!249 = !DILocalVariable(name: "Class", scope: !238, file: !16, line: 131, type: !243)
!250 = !DILocation(line: 131, column: 8, scope: !238)
!251 = !DILocalVariable(name: "verified", scope: !238, file: !16, line: 132, type: !167)
!252 = !DILocation(line: 132, column: 11, scope: !238)
!253 = !DILocalVariable(name: "mflops", scope: !238, file: !16, line: 133, type: !12)
!254 = !DILocation(line: 133, column: 10, scope: !238)
!255 = !DILocalVariable(name: "t", scope: !238, file: !16, line: 135, type: !12)
!256 = !DILocation(line: 135, column: 10, scope: !238)
!257 = !DILocalVariable(name: "tmax", scope: !238, file: !16, line: 135, type: !12)
!258 = !DILocation(line: 135, column: 13, scope: !238)
!259 = !DILocalVariable(name: "trecs", scope: !238, file: !16, line: 135, type: !260)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 768, align: 64, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 12, lowerBound: 0)
!263 = !DILocation(line: 135, column: 19, scope: !238)
!264 = !DILocalVariable(name: "i", scope: !238, file: !16, line: 136, type: !41)
!265 = !DILocation(line: 136, column: 7, scope: !238)
!266 = !DILocalVariable(name: "t_names", scope: !238, file: !16, line: 137, type: !267)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 768, align: 64, elements: !261)
!268 = !DILocation(line: 137, column: 9, scope: !238)
!269 = !DILocalVariable(name: "fp", scope: !238, file: !16, line: 142, type: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !272, line: 48, baseType: !273)
!272 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/cec/src/install")
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !274, line: 241, size: 1728, align: 64, elements: !275)
!274 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/cec/src/install")
!275 = !{!276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !296, !297, !298, !299, !303, !305, !307, !311, !314, !316, !317, !318, !319, !320, !324, !325}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !273, file: !274, line: 242, baseType: !41, size: 32, align: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !273, file: !274, line: 247, baseType: !242, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !273, file: !274, line: 248, baseType: !242, size: 64, align: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !273, file: !274, line: 249, baseType: !242, size: 64, align: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !273, file: !274, line: 250, baseType: !242, size: 64, align: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !273, file: !274, line: 251, baseType: !242, size: 64, align: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !273, file: !274, line: 252, baseType: !242, size: 64, align: 64, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !273, file: !274, line: 253, baseType: !242, size: 64, align: 64, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !273, file: !274, line: 254, baseType: !242, size: 64, align: 64, offset: 512)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !273, file: !274, line: 256, baseType: !242, size: 64, align: 64, offset: 576)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !273, file: !274, line: 257, baseType: !242, size: 64, align: 64, offset: 640)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !273, file: !274, line: 258, baseType: !242, size: 64, align: 64, offset: 704)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !273, file: !274, line: 260, baseType: !289, size: 64, align: 64, offset: 768)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !274, line: 156, size: 192, align: 64, elements: !291)
!291 = !{!292, !293, !295}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !290, file: !274, line: 157, baseType: !289, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !290, file: !274, line: 158, baseType: !294, size: 64, align: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !290, file: !274, line: 162, baseType: !41, size: 32, align: 32, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !273, file: !274, line: 262, baseType: !294, size: 64, align: 64, offset: 832)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !273, file: !274, line: 264, baseType: !41, size: 32, align: 32, offset: 896)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !273, file: !274, line: 268, baseType: !41, size: 32, align: 32, offset: 928)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !273, file: !274, line: 270, baseType: !300, size: 64, align: 64, offset: 960)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !301, line: 131, baseType: !302)
!301 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/cec/src/install")
!302 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !273, file: !274, line: 274, baseType: !304, size: 16, align: 16, offset: 1024)
!304 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !273, file: !274, line: 275, baseType: !306, size: 8, align: 8, offset: 1040)
!306 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !273, file: !274, line: 276, baseType: !308, size: 8, align: 8, offset: 1048)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 8, align: 8, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 1, lowerBound: 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !273, file: !274, line: 280, baseType: !312, size: 64, align: 64, offset: 1088)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !274, line: 150, baseType: null)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !273, file: !274, line: 289, baseType: !315, size: 64, align: 64, offset: 1152)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !301, line: 132, baseType: !302)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !273, file: !274, line: 297, baseType: !11, size: 64, align: 64, offset: 1216)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !273, file: !274, line: 298, baseType: !11, size: 64, align: 64, offset: 1280)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !273, file: !274, line: 299, baseType: !11, size: 64, align: 64, offset: 1344)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !273, file: !274, line: 300, baseType: !11, size: 64, align: 64, offset: 1408)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !273, file: !274, line: 302, baseType: !321, size: 64, align: 64, offset: 1472)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !322, line: 62, baseType: !323)
!322 = !DIFile(filename: "/usr/lib/llvm-3.8/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/home/cec/src/install")
!323 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !273, file: !274, line: 303, baseType: !41, size: 32, align: 32, offset: 1536)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !273, file: !274, line: 305, baseType: !326, size: 160, align: 8, offset: 1568)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 160, align: 8, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 20, lowerBound: 0)
!329 = !DILocation(line: 142, column: 9, scope: !238)
!330 = !DILocation(line: 143, column: 13, scope: !331)
!331 = distinct !DILexicalBlock(scope: !238, file: !16, line: 143, column: 7)
!332 = !DILocation(line: 143, column: 11, scope: !331)
!333 = !DILocation(line: 143, column: 39, scope: !331)
!334 = !DILocation(line: 143, column: 7, scope: !238)
!335 = !DILocation(line: 144, column: 13, scope: !336)
!336 = distinct !DILexicalBlock(scope: !331, file: !16, line: 143, column: 54)
!337 = !DILocation(line: 145, column: 5, scope: !336)
!338 = !DILocation(line: 145, column: 16, scope: !336)
!339 = !DILocation(line: 146, column: 5, scope: !336)
!340 = !DILocation(line: 146, column: 16, scope: !336)
!341 = !DILocation(line: 147, column: 5, scope: !336)
!342 = !DILocation(line: 147, column: 16, scope: !336)
!343 = !DILocation(line: 148, column: 5, scope: !336)
!344 = !DILocation(line: 148, column: 16, scope: !336)
!345 = !DILocation(line: 149, column: 5, scope: !336)
!346 = !DILocation(line: 149, column: 16, scope: !336)
!347 = !DILocation(line: 150, column: 5, scope: !336)
!348 = !DILocation(line: 150, column: 16, scope: !336)
!349 = !DILocation(line: 151, column: 5, scope: !336)
!350 = !DILocation(line: 151, column: 16, scope: !336)
!351 = !DILocation(line: 152, column: 5, scope: !336)
!352 = !DILocation(line: 152, column: 16, scope: !336)
!353 = !DILocation(line: 153, column: 5, scope: !336)
!354 = !DILocation(line: 153, column: 16, scope: !336)
!355 = !DILocation(line: 154, column: 5, scope: !336)
!356 = !DILocation(line: 154, column: 17, scope: !336)
!357 = !DILocation(line: 155, column: 5, scope: !336)
!358 = !DILocation(line: 155, column: 17, scope: !336)
!359 = !DILocation(line: 156, column: 12, scope: !336)
!360 = !DILocation(line: 156, column: 5, scope: !336)
!361 = !DILocation(line: 157, column: 3, scope: !336)
!362 = !DILocation(line: 158, column: 13, scope: !363)
!363 = distinct !DILexicalBlock(scope: !331, file: !16, line: 157, column: 10)
!364 = !DILocation(line: 164, column: 3, scope: !238)
!365 = !DILocation(line: 169, column: 3, scope: !238)
!366 = !DILocation(line: 174, column: 3, scope: !238)
!367 = !DILocation(line: 179, column: 3, scope: !238)
!368 = !DILocation(line: 184, column: 3, scope: !238)
!369 = !DILocation(line: 189, column: 3, scope: !238)
!370 = !DILocation(line: 194, column: 3, scope: !238)
!371 = !DILocation(line: 199, column: 3, scope: !238)
!372 = !DILocation(line: 200, column: 3, scope: !238)
!373 = !DILocation(line: 205, column: 8, scope: !238)
!374 = !DILocation(line: 205, column: 3, scope: !238)
!375 = !DILocation(line: 210, column: 3, scope: !238)
!376 = !DILocation(line: 215, column: 3, scope: !238)
!377 = !DILocation(line: 220, column: 26, scope: !238)
!378 = !DILocation(line: 220, column: 3, scope: !238)
!379 = !DILocation(line: 221, column: 20, scope: !238)
!380 = !DILocation(line: 221, column: 12, scope: !238)
!381 = !DILocation(line: 221, column: 47, scope: !238)
!382 = !DILocation(line: 221, column: 39, scope: !238)
!383 = !DILocation(line: 221, column: 37, scope: !238)
!384 = !DILocation(line: 222, column: 17, scope: !238)
!385 = !DILocation(line: 222, column: 9, scope: !238)
!386 = !DILocation(line: 222, column: 7, scope: !238)
!387 = !DILocation(line: 223, column: 17, scope: !238)
!388 = !DILocation(line: 223, column: 9, scope: !238)
!389 = !DILocation(line: 223, column: 7, scope: !238)
!390 = !DILocation(line: 224, column: 33, scope: !238)
!391 = !DILocation(line: 224, column: 37, scope: !238)
!392 = !DILocation(line: 224, column: 36, scope: !238)
!393 = !DILocation(line: 224, column: 41, scope: !238)
!394 = !DILocation(line: 224, column: 40, scope: !238)
