; ModuleID = '/home/haolin/project/paper7/dataset/10_0_0/test/npb-v0/npb-v0_69_temp.bc'
source_filename = "/home/cec/src/install/SP/CMakeFiles/SP.dir/src/sp.bc"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

@.str = private unnamed_addr constant [11 x i8] c"timer.flag\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@timeron = common global i32 0, align 4, !dbg !0
@.str.2 = private unnamed_addr constant [6 x i8] c"total\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"rhsx\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"rhsy\00", align 1
@.str.5 = private unnamed_addr constant [5 x i8] c"rhsz\00", align 1
@.str.6 = private unnamed_addr constant [4 x i8] c"rhs\00", align 1
@.str.7 = private unnamed_addr constant [7 x i8] c"xsolve\00", align 1
@.str.8 = private unnamed_addr constant [7 x i8] c"ysolve\00", align 1
@.str.9 = private unnamed_addr constant [7 x i8] c"zsolve\00", align 1
@.str.10 = private unnamed_addr constant [8 x i8] c"redist1\00", align 1
@.str.11 = private unnamed_addr constant [8 x i8] c"redist2\00", align 1
@.str.12 = private unnamed_addr constant [7 x i8] c"tzetar\00", align 1
@.str.13 = private unnamed_addr constant [6 x i8] c"ninvr\00", align 1
@.str.14 = private unnamed_addr constant [6 x i8] c"pinvr\00", align 1
@.str.15 = private unnamed_addr constant [7 x i8] c"txinvr\00", align 1

!369 = distinct !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!370 = distinct !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!371 = distinct !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!372 = distinct !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!373 = distinct !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!374 = distinct !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!375 = distinct !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!376 = distinct !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!377 = distinct !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!378 = distinct !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!379 = distinct !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!380 = distinct !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!381 = distinct !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!382 = distinct !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!383 = distinct !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!384 = distinct !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!385 = distinct !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!386 = distinct !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!387 = distinct !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!388 = distinct !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!389 = distinct !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!390 = distinct !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!391 = distinct !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!392 = distinct !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!393 = distinct !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!394 = distinct !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!395 = distinct !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!396 = distinct !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!397 = distinct !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!398 = distinct !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!399 = distinct !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!400 = !{i32 2, !"Dwarf Version", i32 4}
!401 = !{i32 2, !"Debug Info Version", i32 3}
!402 = !{!"clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)"}
!403 = distinct !DISubprogram(name: "main", scope: !16, file: !16, line: 92, type: !404, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !409)
!404 = !DISubroutineType(types: !405)
!405 = !{!18, !18, !406}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!409 = !{}
!410 = !DILocalVariable(name: "argc", arg: 1, scope: !403, file: !16, line: 92, type: !18)
!411 = !DILocation(line: 92, column: 14, scope: !403)
!412 = !DILocalVariable(name: "argv", arg: 2, scope: !403, file: !16, line: 92, type: !406)
!413 = !DILocation(line: 92, column: 26, scope: !403)
!414 = !DILocalVariable(name: "i", scope: !403, file: !16, line: 94, type: !18)
!415 = !DILocation(line: 94, column: 7, scope: !403)
!416 = !DILocalVariable(name: "niter", scope: !403, file: !16, line: 94, type: !18)
!417 = !DILocation(line: 94, column: 10, scope: !403)
!418 = !DILocalVariable(name: "step", scope: !403, file: !16, line: 94, type: !18)
!419 = !DILocation(line: 94, column: 17, scope: !403)
!420 = !DILocalVariable(name: "n3", scope: !403, file: !16, line: 94, type: !18)
!421 = !DILocation(line: 94, column: 23, scope: !403)
!422 = !DILocalVariable(name: "mflops", scope: !403, file: !16, line: 95, type: !12)
!423 = !DILocation(line: 95, column: 10, scope: !403)
!424 = !DILocalVariable(name: "t", scope: !403, file: !16, line: 95, type: !12)
!425 = !DILocation(line: 95, column: 18, scope: !403)
!426 = !DILocalVariable(name: "tmax", scope: !403, file: !16, line: 95, type: !12)
!427 = !DILocation(line: 95, column: 21, scope: !403)
!428 = !DILocalVariable(name: "trecs", scope: !403, file: !16, line: 95, type: !429)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 1024, align: 64, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 16, lowerBound: 0)
!432 = !DILocation(line: 95, column: 27, scope: !403)
!433 = !DILocalVariable(name: "verified", scope: !403, file: !16, line: 96, type: !278)
!434 = !DILocation(line: 96, column: 11, scope: !403)
!435 = !DILocalVariable(name: "Class", scope: !403, file: !16, line: 97, type: !408)
!436 = !DILocation(line: 97, column: 8, scope: !403)
!437 = !DILocalVariable(name: "t_names", scope: !403, file: !16, line: 98, type: !438)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 1024, align: 64, elements: !430)
!439 = !DILocation(line: 98, column: 9, scope: !403)
!440 = !DILocalVariable(name: "fp", scope: !403, file: !16, line: 104, type: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !443, line: 48, baseType: !444)
!443 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/cec/src/install")
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !445, line: 241, size: 1728, align: 64, elements: !446)
!445 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/cec/src/install")
!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !467, !468, !469, !470, !474, !476, !478, !482, !485, !487, !488, !489, !490, !491, !495, !496}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !444, file: !445, line: 242, baseType: !18, size: 32, align: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !444, file: !445, line: 247, baseType: !407, size: 64, align: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !444, file: !445, line: 248, baseType: !407, size: 64, align: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !444, file: !445, line: 249, baseType: !407, size: 64, align: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !444, file: !445, line: 250, baseType: !407, size: 64, align: 64, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !444, file: !445, line: 251, baseType: !407, size: 64, align: 64, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !444, file: !445, line: 252, baseType: !407, size: 64, align: 64, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !444, file: !445, line: 253, baseType: !407, size: 64, align: 64, offset: 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !444, file: !445, line: 254, baseType: !407, size: 64, align: 64, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !444, file: !445, line: 256, baseType: !407, size: 64, align: 64, offset: 576)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !444, file: !445, line: 257, baseType: !407, size: 64, align: 64, offset: 640)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !444, file: !445, line: 258, baseType: !407, size: 64, align: 64, offset: 704)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !444, file: !445, line: 260, baseType: !460, size: 64, align: 64, offset: 768)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !445, line: 156, size: 192, align: 64, elements: !462)
!462 = !{!463, !464, !466}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !461, file: !445, line: 157, baseType: !460, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !461, file: !445, line: 158, baseType: !465, size: 64, align: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !461, file: !445, line: 162, baseType: !18, size: 32, align: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !444, file: !445, line: 262, baseType: !465, size: 64, align: 64, offset: 832)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !444, file: !445, line: 264, baseType: !18, size: 32, align: 32, offset: 896)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !444, file: !445, line: 268, baseType: !18, size: 32, align: 32, offset: 928)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !444, file: !445, line: 270, baseType: !471, size: 64, align: 64, offset: 960)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !472, line: 131, baseType: !473)
!472 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/cec/src/install")
!473 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !444, file: !445, line: 274, baseType: !475, size: 16, align: 16, offset: 1024)
!475 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !444, file: !445, line: 275, baseType: !477, size: 8, align: 8, offset: 1040)
!477 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !444, file: !445, line: 276, baseType: !479, size: 8, align: 8, offset: 1048)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 8, align: 8, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 1, lowerBound: 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !444, file: !445, line: 280, baseType: !483, size: 64, align: 64, offset: 1088)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !445, line: 150, baseType: null)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !444, file: !445, line: 289, baseType: !486, size: 64, align: 64, offset: 1152)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !472, line: 132, baseType: !473)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !444, file: !445, line: 297, baseType: !11, size: 64, align: 64, offset: 1216)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !444, file: !445, line: 298, baseType: !11, size: 64, align: 64, offset: 1280)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !444, file: !445, line: 299, baseType: !11, size: 64, align: 64, offset: 1344)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !444, file: !445, line: 300, baseType: !11, size: 64, align: 64, offset: 1408)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !444, file: !445, line: 302, baseType: !492, size: 64, align: 64, offset: 1472)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !493, line: 62, baseType: !494)
!493 = !DIFile(filename: "/usr/lib/llvm-3.8/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/home/cec/src/install")
!494 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !444, file: !445, line: 303, baseType: !18, size: 32, align: 32, offset: 1536)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !444, file: !445, line: 305, baseType: !497, size: 160, align: 8, offset: 1568)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 160, align: 8, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 20, lowerBound: 0)
!500 = !DILocation(line: 104, column: 9, scope: !403)
!501 = !DILocation(line: 105, column: 13, scope: !502)
!502 = distinct !DILexicalBlock(scope: !403, file: !16, line: 105, column: 7)
!503 = !DILocation(line: 105, column: 11, scope: !502)
!504 = !DILocation(line: 105, column: 39, scope: !502)
!505 = !DILocation(line: 105, column: 7, scope: !403)
!506 = !DILocation(line: 106, column: 13, scope: !507)
!507 = distinct !DILexicalBlock(scope: !502, file: !16, line: 105, column: 54)
!508 = !DILocation(line: 107, column: 5, scope: !507)
!509 = !DILocation(line: 107, column: 16, scope: !507)
!510 = !DILocation(line: 108, column: 5, scope: !507)
!511 = !DILocation(line: 108, column: 16, scope: !507)
!512 = !DILocation(line: 109, column: 5, scope: !507)
!513 = !DILocation(line: 109, column: 16, scope: !507)
!514 = !DILocation(line: 110, column: 5, scope: !507)
!515 = !DILocation(line: 110, column: 16, scope: !507)
!516 = !DILocation(line: 111, column: 5, scope: !507)
!517 = !DILocation(line: 111, column: 16, scope: !507)
!518 = !DILocation(line: 112, column: 5, scope: !507)
!519 = !DILocation(line: 112, column: 16, scope: !507)
!520 = !DILocation(line: 113, column: 5, scope: !507)
!521 = !DILocation(line: 113, column: 16, scope: !507)
!522 = !DILocation(line: 114, column: 5, scope: !507)
!523 = !DILocation(line: 114, column: 16, scope: !507)
!524 = !DILocation(line: 115, column: 5, scope: !507)
!525 = !DILocation(line: 115, column: 16, scope: !507)
!526 = !DILocation(line: 116, column: 5, scope: !507)
!527 = !DILocation(line: 116, column: 17, scope: !507)
!528 = !DILocation(line: 117, column: 5, scope: !507)
!529 = !DILocation(line: 117, column: 17, scope: !507)
!530 = !DILocation(line: 118, column: 5, scope: !507)
!531 = !DILocation(line: 118, column: 17, scope: !507)
!532 = !DILocation(line: 119, column: 5, scope: !507)
!533 = !DILocation(line: 119, column: 17, scope: !507)
!534 = !DILocation(line: 120, column: 5, scope: !507)
!535 = !DILocation(line: 120, column: 17, scope: !507)
!536 = !DILocation(line: 121, column: 5, scope: !507)
!537 = !DILocation(line: 121, column: 17, scope: !507)
!538 = !DILocation(line: 122, column: 12, scope: !507)
!539 = !DILocation(line: 122, column: 5, scope: !507)
!540 = !DILocation(line: 123, column: 3, scope: !507)
!541 = !DILocation(line: 124, column: 13, scope: !542)
!542 = distinct !DILexicalBlock(scope: !502, file: !16, line: 123, column: 10)
!543 = !DILocation(line: 127, column: 3, scope: !403)
!544 = !DILocation(line: 129, column: 13, scope: !545)
!545 = distinct !DILexicalBlock(scope: !403, file: !16, line: 129, column: 7)
!546 = !DILocation(line: 129, column: 11, scope: !545)
!547 = !DILocation(line: 129, column: 41, scope: !545)
!548 = !DILocation(line: 129, column: 7, scope: !403)
!549 = !DILocalVariable(name: "result", scope: !550, file: !16, line: 130, type: !18)
!550 = distinct !DILexicalBlock(scope: !545, file: !16, line: 129, column: 56)
!551 = !DILocation(line: 130, column: 9, scope: !550)
!552 = !DILocation(line: 131, column: 5, scope: !550)
!553 = !DILocation(line: 132, column: 21, scope: !550)
!554 = !DILocation(line: 132, column: 14, scope: !550)
!555 = !DILocation(line: 132, column: 12, scope: !550)
!556 = !DILocation(line: 133, column: 5, scope: !550)
!557 = !DILocation(line: 133, column: 18, scope: !550)
!558 = !DILocation(line: 133, column: 12, scope: !550)
!559 = !DILocation(line: 133, column: 22, scope: !550)
!560 = !DILocation(line: 134, column: 21, scope: !550)
!561 = !DILocation(line: 134, column: 14, scope: !550)
!562 = !DILocation(line: 134, column: 12, scope: !550)
!563 = !DILocation(line: 135, column: 5, scope: !550)
!564 = !DILocation(line: 135, column: 18, scope: !550)
