; ModuleID = '/home/xxx/project/paper7/dataset/10_0_0/test/npb-v0/npb-v0_81_temp.bc'
source_filename = "/home/cec/src/install/BT/CMakeFiles/BT.dir/src/bt.bc"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

@.str = private unnamed_addr constant [11 x i8] c"timer.flag\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@timeron = common global i32 0, align 4, !dbg !0
@.str.2 = private unnamed_addr constant [6 x i8] c"total\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"rhsx\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"rhsy\00", align 1
@.str.5 = private unnamed_addr constant [5 x i8] c"rhsz\00", align 1
@.str.6 = private unnamed_addr constant [4 x i8] c"rhs\00", align 1
@.str.7 = private unnamed_addr constant [7 x i8] c"xsolve\00", align 1
@.str.8 = private unnamed_addr constant [7 x i8] c"ysolve\00", align 1
@.str.9 = private unnamed_addr constant [7 x i8] c"zsolve\00", align 1
@.str.10 = private unnamed_addr constant [8 x i8] c"redist1\00", align 1
@.str.11 = private unnamed_addr constant [8 x i8] c"redist2\00", align 1
@.str.12 = private unnamed_addr constant [4 x i8] c"add\00", align 1
@.str.13 = private unnamed_addr constant [59 x i8] c"\0A\0A NAS Parallel Benchmarks (NPB3.3-SER-C) - BT Benchmark\0A\0A\00", align 1
@.str.14 = private unnamed_addr constant [13 x i8] c"inputbt.data\00", align 1

!358 = distinct !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!359 = distinct !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!360 = distinct !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!361 = distinct !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!362 = distinct !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!363 = distinct !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!364 = distinct !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!365 = distinct !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!366 = distinct !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!367 = distinct !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!368 = distinct !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!369 = distinct !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!370 = distinct !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!371 = distinct !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!372 = distinct !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!373 = distinct !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!374 = distinct !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!375 = distinct !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!376 = distinct !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!377 = distinct !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!378 = distinct !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!379 = distinct !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!380 = distinct !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!381 = distinct !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!382 = distinct !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!383 = distinct !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!384 = distinct !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!385 = distinct !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!386 = distinct !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!387 = !{i32 2, !"Dwarf Version", i32 4}
!388 = !{i32 2, !"Debug Info Version", i32 3}
!389 = !{!"clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)"}
!390 = distinct !DISubprogram(name: "main", scope: !16, file: !16, line: 92, type: !391, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !396)
!391 = !DISubroutineType(types: !392)
!392 = !{!20, !20, !393}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!396 = !{}
!397 = !DILocalVariable(name: "argc", arg: 1, scope: !390, file: !16, line: 92, type: !20)
!398 = !DILocation(line: 92, column: 14, scope: !390)
!399 = !DILocalVariable(name: "argv", arg: 2, scope: !390, file: !16, line: 92, type: !393)
!400 = !DILocation(line: 92, column: 26, scope: !390)
!401 = !DILocalVariable(name: "i", scope: !390, file: !16, line: 94, type: !20)
!402 = !DILocation(line: 94, column: 7, scope: !390)
!403 = !DILocalVariable(name: "niter", scope: !390, file: !16, line: 94, type: !20)
!404 = !DILocation(line: 94, column: 10, scope: !390)
!405 = !DILocalVariable(name: "step", scope: !390, file: !16, line: 94, type: !20)
!406 = !DILocation(line: 94, column: 17, scope: !390)
!407 = !DILocalVariable(name: "navg", scope: !390, file: !16, line: 95, type: !12)
!408 = !DILocation(line: 95, column: 10, scope: !390)
!409 = !DILocalVariable(name: "mflops", scope: !390, file: !16, line: 95, type: !12)
!410 = !DILocation(line: 95, column: 16, scope: !390)
!411 = !DILocalVariable(name: "n3", scope: !390, file: !16, line: 95, type: !12)
!412 = !DILocation(line: 95, column: 24, scope: !390)
!413 = !DILocalVariable(name: "tmax", scope: !390, file: !16, line: 97, type: !12)
!414 = !DILocation(line: 97, column: 10, scope: !390)
!415 = !DILocalVariable(name: "t", scope: !390, file: !16, line: 97, type: !12)
!416 = !DILocation(line: 97, column: 16, scope: !390)
!417 = !DILocalVariable(name: "trecs", scope: !390, file: !16, line: 97, type: !418)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 768, align: 64, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 12, lowerBound: 0)
!421 = !DILocation(line: 97, column: 19, scope: !390)
!422 = !DILocalVariable(name: "verified", scope: !390, file: !16, line: 98, type: !270)
!423 = !DILocation(line: 98, column: 11, scope: !390)
!424 = !DILocalVariable(name: "Class", scope: !390, file: !16, line: 99, type: !395)
!425 = !DILocation(line: 99, column: 8, scope: !390)
!426 = !DILocalVariable(name: "t_names", scope: !390, file: !16, line: 100, type: !427)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 768, align: 64, elements: !419)
!428 = !DILocation(line: 100, column: 9, scope: !390)
!429 = !DILocalVariable(name: "fp", scope: !390, file: !16, line: 106, type: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !432, line: 48, baseType: !433)
!432 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/cec/src/install")
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !434, line: 241, size: 1728, align: 64, elements: !435)
!434 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/cec/src/install")
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !456, !457, !458, !459, !463, !465, !467, !471, !474, !476, !477, !478, !479, !480, !484, !485}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !433, file: !434, line: 242, baseType: !20, size: 32, align: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !433, file: !434, line: 247, baseType: !394, size: 64, align: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !433, file: !434, line: 248, baseType: !394, size: 64, align: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !433, file: !434, line: 249, baseType: !394, size: 64, align: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !433, file: !434, line: 250, baseType: !394, size: 64, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !433, file: !434, line: 251, baseType: !394, size: 64, align: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !433, file: !434, line: 252, baseType: !394, size: 64, align: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !433, file: !434, line: 253, baseType: !394, size: 64, align: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !433, file: !434, line: 254, baseType: !394, size: 64, align: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !433, file: !434, line: 256, baseType: !394, size: 64, align: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !433, file: !434, line: 257, baseType: !394, size: 64, align: 64, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !433, file: !434, line: 258, baseType: !394, size: 64, align: 64, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !433, file: !434, line: 260, baseType: !449, size: 64, align: 64, offset: 768)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !434, line: 156, size: 192, align: 64, elements: !451)
!451 = !{!452, !453, !455}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !450, file: !434, line: 157, baseType: !449, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !450, file: !434, line: 158, baseType: !454, size: 64, align: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !450, file: !434, line: 162, baseType: !20, size: 32, align: 32, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !433, file: !434, line: 262, baseType: !454, size: 64, align: 64, offset: 832)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !433, file: !434, line: 264, baseType: !20, size: 32, align: 32, offset: 896)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !433, file: !434, line: 268, baseType: !20, size: 32, align: 32, offset: 928)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !433, file: !434, line: 270, baseType: !460, size: 64, align: 64, offset: 960)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !461, line: 131, baseType: !462)
!461 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/cec/src/install")
!462 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !433, file: !434, line: 274, baseType: !464, size: 16, align: 16, offset: 1024)
!464 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !433, file: !434, line: 275, baseType: !466, size: 8, align: 8, offset: 1040)
!466 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !433, file: !434, line: 276, baseType: !468, size: 8, align: 8, offset: 1048)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 8, align: 8, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 1, lowerBound: 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !433, file: !434, line: 280, baseType: !472, size: 64, align: 64, offset: 1088)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !434, line: 150, baseType: null)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !433, file: !434, line: 289, baseType: !475, size: 64, align: 64, offset: 1152)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !461, line: 132, baseType: !462)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !433, file: !434, line: 297, baseType: !11, size: 64, align: 64, offset: 1216)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !433, file: !434, line: 298, baseType: !11, size: 64, align: 64, offset: 1280)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !433, file: !434, line: 299, baseType: !11, size: 64, align: 64, offset: 1344)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !433, file: !434, line: 300, baseType: !11, size: 64, align: 64, offset: 1408)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !433, file: !434, line: 302, baseType: !481, size: 64, align: 64, offset: 1472)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !482, line: 62, baseType: !483)
!482 = !DIFile(filename: "/usr/lib/llvm-3.8/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/home/cec/src/install")
!483 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !433, file: !434, line: 303, baseType: !20, size: 32, align: 32, offset: 1536)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !433, file: !434, line: 305, baseType: !486, size: 160, align: 8, offset: 1568)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 160, align: 8, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 20, lowerBound: 0)
!489 = !DILocation(line: 106, column: 9, scope: !390)
!490 = !DILocation(line: 107, column: 13, scope: !491)
!491 = distinct !DILexicalBlock(scope: !390, file: !16, line: 107, column: 7)
!492 = !DILocation(line: 107, column: 11, scope: !491)
!493 = !DILocation(line: 107, column: 39, scope: !491)
!494 = !DILocation(line: 107, column: 7, scope: !390)
!495 = !DILocation(line: 108, column: 13, scope: !496)
!496 = distinct !DILexicalBlock(scope: !491, file: !16, line: 107, column: 54)
!497 = !DILocation(line: 109, column: 5, scope: !496)
!498 = !DILocation(line: 109, column: 16, scope: !496)
!499 = !DILocation(line: 110, column: 5, scope: !496)
!500 = !DILocation(line: 110, column: 16, scope: !496)
!501 = !DILocation(line: 111, column: 5, scope: !496)
!502 = !DILocation(line: 111, column: 16, scope: !496)
!503 = !DILocation(line: 112, column: 5, scope: !496)
!504 = !DILocation(line: 112, column: 16, scope: !496)
!505 = !DILocation(line: 113, column: 5, scope: !496)
!506 = !DILocation(line: 113, column: 16, scope: !496)
!507 = !DILocation(line: 114, column: 5, scope: !496)
!508 = !DILocation(line: 114, column: 16, scope: !496)
!509 = !DILocation(line: 115, column: 5, scope: !496)
!510 = !DILocation(line: 115, column: 16, scope: !496)
!511 = !DILocation(line: 116, column: 5, scope: !496)
!512 = !DILocation(line: 116, column: 16, scope: !496)
!513 = !DILocation(line: 117, column: 5, scope: !496)
!514 = !DILocation(line: 117, column: 16, scope: !496)
!515 = !DILocation(line: 118, column: 5, scope: !496)
!516 = !DILocation(line: 118, column: 17, scope: !496)
!517 = !DILocation(line: 119, column: 5, scope: !496)
!518 = !DILocation(line: 119, column: 17, scope: !496)
!519 = !DILocation(line: 120, column: 12, scope: !496)
!520 = !DILocation(line: 120, column: 5, scope: !496)
!521 = !DILocation(line: 121, column: 3, scope: !496)
!522 = !DILocation(line: 122, column: 13, scope: !523)
!523 = distinct !DILexicalBlock(scope: !491, file: !16, line: 121, column: 10)
!524 = !DILocation(line: 125, column: 3, scope: !390)
!525 = !DILocation(line: 127, column: 13, scope: !526)
!526 = distinct !DILexicalBlock(scope: !390, file: !16, line: 127, column: 7)
!527 = !DILocation(line: 127, column: 11, scope: !526)
!528 = !DILocation(line: 127, column: 41, scope: !526)
!529 = !DILocation(line: 127, column: 7, scope: !390)
!530 = !DILocalVariable(name: "result", scope: !531, file: !16, line: 128, type: !20)
!531 = distinct !DILexicalBlock(scope: !526, file: !16, line: 127, column: 56)
!532 = !DILocation(line: 128, column: 9, scope: !531)
!533 = !DILocation(line: 129, column: 5, scope: !531)
!534 = !DILocation(line: 130, column: 21, scope: !531)
!535 = !DILocation(line: 130, column: 14, scope: !531)
!536 = !DILocation(line: 130, column: 12, scope: !531)
!537 = !DILocation(line: 131, column: 5, scope: !531)
!538 = !DILocation(line: 131, column: 18, scope: !531)
!539 = !DILocation(line: 131, column: 12, scope: !531)
!540 = !DILocation(line: 131, column: 22, scope: !531)
!541 = !DILocation(line: 132, column: 21, scope: !531)
!542 = !DILocation(line: 132, column: 14, scope: !531)
!543 = !DILocation(line: 132, column: 12, scope: !531)
!544 = !DILocation(line: 133, column: 5, scope: !531)
!545 = !DILocation(line: 133, column: 18, scope: !531)
!546 = !DILocation(line: 133, column: 12, scope: !531)
!547 = !DILocation(line: 133, column: 22, scope: !531)
!548 = !DILocation(line: 134, column: 21, scope: !531)
!549 = !DILocation(line: 134, column: 14, scope: !531)
!550 = !DILocation(line: 134, column: 12, scope: !531)
!551 = !DILocation(line: 136, column: 12, scope: !531)
!552 = !DILocation(line: 136, column: 5, scope: !531)
!553 = !DILocation(line: 137, column: 3, scope: !531)
