; ModuleID = '/home/haolin/project/paper7/dataset/10_0_0/test/npb-v0/npb-v0_47_temp.bc'
source_filename = "/home/cec/src/install/UA/CMakeFiles/UA.dir/src/ua.bc"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

@.str = private unnamed_addr constant [11 x i8] c"timer.flag\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@timeron = common global i32 0, align 4, !dbg !0
@.str.2 = private unnamed_addr constant [6 x i8] c"total\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"init\00", align 1
@.str.4 = private unnamed_addr constant [8 x i8] c"convect\00", align 1
@.str.5 = private unnamed_addr constant [10 x i8] c"transfb_c\00", align 1
@.str.6 = private unnamed_addr constant [10 x i8] c"diffusion\00", align 1
@.str.7 = private unnamed_addr constant [7 x i8] c"transf\00", align 1
@.str.8 = private unnamed_addr constant [8 x i8] c"transfb\00", align 1
@.str.9 = private unnamed_addr constant [11 x i8] c"adaptation\00", align 1
@.str.10 = private unnamed_addr constant [9 x i8] c"transf+b\00", align 1
@.str.11 = private unnamed_addr constant [5 x i8] c"add2\00", align 1
@.str.12 = private unnamed_addr constant [59 x i8] c"\0A\0A NAS Parallel Benchmarks (NPB3.3-SER-C) - UA Benchmark\0A\0A\00", align 1
@.str.13 = private unnamed_addr constant [13 x i8] c"inputua.data\00", align 1

!463 = distinct !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!464 = distinct !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!465 = distinct !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!466 = distinct !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!467 = distinct !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!468 = distinct !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!469 = distinct !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!470 = distinct !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!471 = distinct !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!472 = distinct !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!473 = distinct !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!474 = distinct !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!475 = distinct !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!476 = distinct !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!477 = distinct !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!478 = distinct !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!479 = distinct !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!480 = distinct !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!481 = distinct !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!482 = distinct !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!483 = distinct !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!484 = distinct !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!485 = distinct !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!486 = !{i32 2, !"Dwarf Version", i32 4}
!487 = !{i32 2, !"Debug Info Version", i32 3}
!488 = !{!"clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)"}
!489 = distinct !DISubprogram(name: "main", scope: !19, file: !19, line: 239, type: !490, scopeLine: 240, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !495)
!490 = !DISubroutineType(types: !491)
!491 = !{!15, !15, !492}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!495 = !{}
!496 = !DILocalVariable(name: "argc", arg: 1, scope: !489, file: !19, line: 239, type: !15)
!497 = !DILocation(line: 239, column: 14, scope: !489)
!498 = !DILocalVariable(name: "argv", arg: 2, scope: !489, file: !19, line: 239, type: !492)
!499 = !DILocation(line: 239, column: 26, scope: !489)
!500 = !DILocalVariable(name: "step", scope: !489, file: !19, line: 241, type: !15)
!501 = !DILocation(line: 241, column: 7, scope: !489)
!502 = !DILocalVariable(name: "ie", scope: !489, file: !19, line: 241, type: !15)
!503 = !DILocation(line: 241, column: 13, scope: !489)
!504 = !DILocalVariable(name: "iside", scope: !489, file: !19, line: 241, type: !15)
!505 = !DILocation(line: 241, column: 17, scope: !489)
!506 = !DILocalVariable(name: "i", scope: !489, file: !19, line: 241, type: !15)
!507 = !DILocation(line: 241, column: 24, scope: !489)
!508 = !DILocalVariable(name: "j", scope: !489, file: !19, line: 241, type: !15)
!509 = !DILocation(line: 241, column: 27, scope: !489)
!510 = !DILocalVariable(name: "k", scope: !489, file: !19, line: 241, type: !15)
!511 = !DILocation(line: 241, column: 30, scope: !489)
!512 = !DILocalVariable(name: "mflops", scope: !489, file: !19, line: 242, type: !13)
!513 = !DILocation(line: 242, column: 10, scope: !489)
!514 = !DILocalVariable(name: "tmax", scope: !489, file: !19, line: 242, type: !13)
!515 = !DILocation(line: 242, column: 18, scope: !489)
!516 = !DILocalVariable(name: "nelt_tot", scope: !489, file: !19, line: 242, type: !13)
!517 = !DILocation(line: 242, column: 24, scope: !489)
!518 = !DILocalVariable(name: "Class", scope: !489, file: !19, line: 243, type: !494)
!519 = !DILocation(line: 243, column: 8, scope: !489)
!520 = !DILocalVariable(name: "ifmortar", scope: !489, file: !19, line: 244, type: !163)
!521 = !DILocation(line: 244, column: 11, scope: !489)
!522 = !DILocalVariable(name: "verified", scope: !489, file: !19, line: 244, type: !163)
!523 = !DILocation(line: 244, column: 29, scope: !489)
!524 = !DILocalVariable(name: "t2", scope: !489, file: !19, line: 246, type: !13)
!525 = !DILocation(line: 246, column: 10, scope: !489)
!526 = !DILocalVariable(name: "trecs", scope: !489, file: !19, line: 246, type: !527)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 704, align: 64, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 11, lowerBound: 0)
!530 = !DILocation(line: 246, column: 14, scope: !489)
!531 = !DILocalVariable(name: "t_names", scope: !489, file: !19, line: 247, type: !532)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 704, align: 64, elements: !528)
!533 = !DILocation(line: 247, column: 9, scope: !489)
!534 = !DILocalVariable(name: "fp", scope: !489, file: !19, line: 253, type: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !537, line: 48, baseType: !538)
!537 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/cec/src/install")
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !539, line: 241, size: 1728, align: 64, elements: !540)
!539 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/cec/src/install")
!540 = !{!541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !561, !562, !563, !564, !568, !570, !572, !576, !579, !581, !582, !583, !584, !585, !589, !590}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !538, file: !539, line: 242, baseType: !15, size: 32, align: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !538, file: !539, line: 247, baseType: !493, size: 64, align: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !538, file: !539, line: 248, baseType: !493, size: 64, align: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !538, file: !539, line: 249, baseType: !493, size: 64, align: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !538, file: !539, line: 250, baseType: !493, size: 64, align: 64, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !538, file: !539, line: 251, baseType: !493, size: 64, align: 64, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !538, file: !539, line: 252, baseType: !493, size: 64, align: 64, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !538, file: !539, line: 253, baseType: !493, size: 64, align: 64, offset: 448)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !538, file: !539, line: 254, baseType: !493, size: 64, align: 64, offset: 512)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !538, file: !539, line: 256, baseType: !493, size: 64, align: 64, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !538, file: !539, line: 257, baseType: !493, size: 64, align: 64, offset: 640)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !538, file: !539, line: 258, baseType: !493, size: 64, align: 64, offset: 704)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !538, file: !539, line: 260, baseType: !554, size: 64, align: 64, offset: 768)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !539, line: 156, size: 192, align: 64, elements: !556)
!556 = !{!557, !558, !560}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !555, file: !539, line: 157, baseType: !554, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !555, file: !539, line: 158, baseType: !559, size: 64, align: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !555, file: !539, line: 162, baseType: !15, size: 32, align: 32, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !538, file: !539, line: 262, baseType: !559, size: 64, align: 64, offset: 832)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !538, file: !539, line: 264, baseType: !15, size: 32, align: 32, offset: 896)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !538, file: !539, line: 268, baseType: !15, size: 32, align: 32, offset: 928)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !538, file: !539, line: 270, baseType: !565, size: 64, align: 64, offset: 960)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !566, line: 131, baseType: !567)
!566 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/cec/src/install")
!567 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !538, file: !539, line: 274, baseType: !569, size: 16, align: 16, offset: 1024)
!569 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !538, file: !539, line: 275, baseType: !571, size: 8, align: 8, offset: 1040)
!571 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !538, file: !539, line: 276, baseType: !573, size: 8, align: 8, offset: 1048)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 8, align: 8, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 1, lowerBound: 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !538, file: !539, line: 280, baseType: !577, size: 64, align: 64, offset: 1088)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !539, line: 150, baseType: null)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !538, file: !539, line: 289, baseType: !580, size: 64, align: 64, offset: 1152)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !566, line: 132, baseType: !567)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !538, file: !539, line: 297, baseType: !11, size: 64, align: 64, offset: 1216)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !538, file: !539, line: 298, baseType: !11, size: 64, align: 64, offset: 1280)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !538, file: !539, line: 299, baseType: !11, size: 64, align: 64, offset: 1344)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !538, file: !539, line: 300, baseType: !11, size: 64, align: 64, offset: 1408)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !538, file: !539, line: 302, baseType: !586, size: 64, align: 64, offset: 1472)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !587, line: 62, baseType: !588)
!587 = !DIFile(filename: "/usr/lib/llvm-3.8/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/home/cec/src/install")
!588 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !538, file: !539, line: 303, baseType: !15, size: 32, align: 32, offset: 1536)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !538, file: !539, line: 305, baseType: !591, size: 160, align: 8, offset: 1568)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 160, align: 8, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 20, lowerBound: 0)
!594 = !DILocation(line: 253, column: 9, scope: !489)
!595 = !DILocation(line: 254, column: 13, scope: !596)
!596 = distinct !DILexicalBlock(scope: !489, file: !19, line: 254, column: 7)
!597 = !DILocation(line: 254, column: 11, scope: !596)
!598 = !DILocation(line: 254, column: 39, scope: !596)
!599 = !DILocation(line: 254, column: 7, scope: !489)
!600 = !DILocation(line: 255, column: 13, scope: !601)
!601 = distinct !DILexicalBlock(scope: !596, file: !19, line: 254, column: 54)
!602 = !DILocation(line: 256, column: 5, scope: !601)
!603 = !DILocation(line: 256, column: 16, scope: !601)
!604 = !DILocation(line: 257, column: 5, scope: !601)
!605 = !DILocation(line: 257, column: 16, scope: !601)
!606 = !DILocation(line: 258, column: 5, scope: !601)
!607 = !DILocation(line: 258, column: 16, scope: !601)
!608 = !DILocation(line: 259, column: 5, scope: !601)
!609 = !DILocation(line: 259, column: 16, scope: !601)
!610 = !DILocation(line: 260, column: 5, scope: !601)
!611 = !DILocation(line: 260, column: 16, scope: !601)
!612 = !DILocation(line: 261, column: 5, scope: !601)
!613 = !DILocation(line: 261, column: 16, scope: !601)
!614 = !DILocation(line: 262, column: 5, scope: !601)
!615 = !DILocation(line: 262, column: 16, scope: !601)
!616 = !DILocation(line: 263, column: 5, scope: !601)
!617 = !DILocation(line: 263, column: 16, scope: !601)
!618 = !DILocation(line: 264, column: 5, scope: !601)
!619 = !DILocation(line: 264, column: 16, scope: !601)
!620 = !DILocation(line: 265, column: 5, scope: !601)
!621 = !DILocation(line: 265, column: 17, scope: !601)
!622 = !DILocation(line: 266, column: 12, scope: !601)
!623 = !DILocation(line: 266, column: 5, scope: !601)
!624 = !DILocation(line: 267, column: 3, scope: !601)
!625 = !DILocation(line: 268, column: 13, scope: !626)
!626 = distinct !DILexicalBlock(scope: !596, file: !19, line: 267, column: 10)
!627 = !DILocation(line: 271, column: 3, scope: !489)
!628 = !DILocation(line: 273, column: 13, scope: !629)
!629 = distinct !DILexicalBlock(scope: !489, file: !19, line: 273, column: 7)
!630 = !DILocation(line: 273, column: 11, scope: !629)
!631 = !DILocation(line: 273, column: 41, scope: !629)
!632 = !DILocation(line: 273, column: 7, scope: !489)
!633 = !DILocalVariable(name: "result", scope: !634, file: !19, line: 274, type: !15)
!634 = distinct !DILexicalBlock(scope: !629, file: !19, line: 273, column: 56)
!635 = !DILocation(line: 274, column: 9, scope: !634)
!636 = !DILocation(line: 275, column: 5, scope: !634)
!637 = !DILocation(line: 276, column: 21, scope: !634)
!638 = !DILocation(line: 276, column: 14, scope: !634)
!639 = !DILocation(line: 276, column: 12, scope: !634)
!640 = !DILocation(line: 277, column: 5, scope: !634)
!641 = !DILocation(line: 277, column: 18, scope: !634)
!642 = !DILocation(line: 277, column: 12, scope: !634)
!643 = !DILocation(line: 277, column: 22, scope: !634)
!644 = !DILocation(line: 278, column: 21, scope: !634)
!645 = !DILocation(line: 278, column: 14, scope: !634)
!646 = !DILocation(line: 278, column: 12, scope: !634)
!647 = !DILocation(line: 279, column: 5, scope: !634)
!648 = !DILocation(line: 279, column: 18, scope: !634)
!649 = !DILocation(line: 279, column: 12, scope: !634)
!650 = !DILocation(line: 279, column: 22, scope: !634)
!651 = !DILocation(line: 280, column: 21, scope: !634)
!652 = !DILocation(line: 280, column: 14, scope: !634)
!653 = !DILocation(line: 280, column: 12, scope: !634)
!654 = !DILocation(line: 281, column: 5, scope: !634)
!655 = !DILocation(line: 281, column: 18, scope: !634)
!656 = !DILocation(line: 281, column: 12, scope: !634)
!657 = !DILocation(line: 281, column: 22, scope: !634)
!658 = !DILocation(line: 282, column: 21, scope: !634)
