; ModuleID = '/home/haolin/project/paper7/dataset/10_0_0/test/npb-v0/npb-v0_22_temp.bc'
source_filename = "/home/cec/src/install/CG/CMakeFiles/CG.dir/src/cg.bc"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

@.str = private unnamed_addr constant [11 x i8] c"timer.flag\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@timeron = internal global i32 0, align 4, !dbg !0
@.str.2 = private unnamed_addr constant [5 x i8] c"init\00", align 1
@.str.3 = private unnamed_addr constant [8 x i8] c"benchmk\00", align 1
@.str.4 = private unnamed_addr constant [7 x i8] c"conjgd\00", align 1
@firstrow = internal global i32 0, align 4, !dbg !81
@lastrow = internal global i32 0, align 4, !dbg !82
@firstcol = internal global i32 0, align 4, !dbg !83
@lastcol = internal global i32 0, align 4, !dbg !84
@.str.5 = private unnamed_addr constant [59 x i8] c"\0A\0A NAS Parallel Benchmarks (NPB3.3-SER-C) - CG Benchmark\0A\0A\00", align 1
@.str.6 = private unnamed_addr constant [13 x i8] c" Size: %11d\0A\00", align 1
@.str.7 = private unnamed_addr constant [18 x i8] c" Iterations: %5d\0A\00", align 1
@.str.8 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@naa = internal global i32 0, align 4, !dbg !85
@nzz = internal global i32 0, align 4, !dbg !86
@tran = internal global double 0.000000e+00, align 8, !dbg !87

!90 = distinct !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!91 = distinct !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!92 = distinct !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!93 = distinct !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!94 = distinct !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!95 = distinct !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!96 = distinct !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!97 = distinct !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!98 = distinct !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!99 = distinct !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!100 = distinct !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!101 = !{i32 2, !"Dwarf Version", i32 4}
!102 = !{i32 2, !"Debug Info Version", i32 3}
!103 = !{!"clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)"}
!104 = distinct !DISubprogram(name: "main", scope: !23, file: !23, line: 125, type: !105, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !110)
!105 = !DISubroutineType(types: !106)
!106 = !{!14, !14, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!110 = !{}
!111 = !DILocalVariable(name: "argc", arg: 1, scope: !104, file: !23, line: 125, type: !14)
!112 = !DILocation(line: 125, column: 14, scope: !104)
!113 = !DILocalVariable(name: "argv", arg: 2, scope: !104, file: !23, line: 125, type: !107)
!114 = !DILocation(line: 125, column: 26, scope: !104)
!115 = !DILocalVariable(name: "i", scope: !104, file: !23, line: 127, type: !14)
!116 = !DILocation(line: 127, column: 7, scope: !104)
!117 = !DILocalVariable(name: "j", scope: !104, file: !23, line: 127, type: !14)
!118 = !DILocation(line: 127, column: 10, scope: !104)
!119 = !DILocalVariable(name: "k", scope: !104, file: !23, line: 127, type: !14)
!120 = !DILocation(line: 127, column: 13, scope: !104)
!121 = !DILocalVariable(name: "it", scope: !104, file: !23, line: 127, type: !14)
!122 = !DILocation(line: 127, column: 16, scope: !104)
!123 = !DILocalVariable(name: "zeta", scope: !104, file: !23, line: 129, type: !19)
!124 = !DILocation(line: 129, column: 10, scope: !104)
!125 = !DILocalVariable(name: "rnorm", scope: !104, file: !23, line: 130, type: !19)
!126 = !DILocation(line: 130, column: 10, scope: !104)
!127 = !DILocalVariable(name: "norm_temp1", scope: !104, file: !23, line: 131, type: !19)
!128 = !DILocation(line: 131, column: 10, scope: !104)
!129 = !DILocalVariable(name: "norm_temp2", scope: !104, file: !23, line: 131, type: !19)
!130 = !DILocation(line: 131, column: 22, scope: !104)
!131 = !DILocalVariable(name: "t", scope: !104, file: !23, line: 133, type: !19)
!132 = !DILocation(line: 133, column: 10, scope: !104)
!133 = !DILocalVariable(name: "mflops", scope: !104, file: !23, line: 133, type: !19)
!134 = !DILocation(line: 133, column: 13, scope: !104)
!135 = !DILocalVariable(name: "tmax", scope: !104, file: !23, line: 133, type: !19)
!136 = !DILocation(line: 133, column: 21, scope: !104)
!137 = !DILocalVariable(name: "Class", scope: !104, file: !23, line: 134, type: !109)
!138 = !DILocation(line: 134, column: 8, scope: !104)
!139 = !DILocalVariable(name: "verified", scope: !104, file: !23, line: 135, type: !80)
!140 = !DILocation(line: 135, column: 11, scope: !104)
!141 = !DILocalVariable(name: "zeta_verify_value", scope: !104, file: !23, line: 136, type: !19)
!142 = !DILocation(line: 136, column: 10, scope: !104)
!143 = !DILocalVariable(name: "epsilon", scope: !104, file: !23, line: 136, type: !19)
!144 = !DILocation(line: 136, column: 29, scope: !104)
!145 = !DILocalVariable(name: "err", scope: !104, file: !23, line: 136, type: !19)
!146 = !DILocation(line: 136, column: 38, scope: !104)
!147 = !DILocalVariable(name: "t_names", scope: !104, file: !23, line: 138, type: !148)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 192, align: 64, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 3, lowerBound: 0)
!151 = !DILocation(line: 138, column: 9, scope: !104)
!152 = !DILocation(line: 140, column: 10, scope: !153)
!153 = distinct !DILexicalBlock(scope: !104, file: !23, line: 140, column: 3)
!154 = !DILocation(line: 140, column: 8, scope: !153)
!155 = !DILocation(line: 140, column: 15, scope: !156)
!156 = distinct !DILexicalBlock(scope: !153, file: !23, line: 140, column: 3)
!157 = !DILocation(line: 140, column: 17, scope: !156)
!158 = !DILocation(line: 140, column: 3, scope: !153)
!159 = !DILocation(line: 141, column: 17, scope: !160)
!160 = distinct !DILexicalBlock(scope: !156, file: !23, line: 140, column: 27)
!161 = !DILocation(line: 141, column: 5, scope: !160)
!162 = !DILocation(line: 142, column: 3, scope: !160)
!163 = !DILocation(line: 140, column: 23, scope: !156)
!164 = !DILocation(line: 140, column: 3, scope: !156)
!165 = !DILocalVariable(name: "fp", scope: !104, file: !23, line: 144, type: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !168, line: 48, baseType: !169)
!168 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/cec/src/install")
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !170, line: 241, size: 1728, align: 64, elements: !171)
!170 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/cec/src/install")
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !192, !193, !194, !195, !199, !201, !203, !207, !210, !212, !213, !214, !215, !216, !220, !221}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !169, file: !170, line: 242, baseType: !14, size: 32, align: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !169, file: !170, line: 247, baseType: !108, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !169, file: !170, line: 248, baseType: !108, size: 64, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !169, file: !170, line: 249, baseType: !108, size: 64, align: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !169, file: !170, line: 250, baseType: !108, size: 64, align: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !169, file: !170, line: 251, baseType: !108, size: 64, align: 64, offset: 320)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !169, file: !170, line: 252, baseType: !108, size: 64, align: 64, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !169, file: !170, line: 253, baseType: !108, size: 64, align: 64, offset: 448)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !169, file: !170, line: 254, baseType: !108, size: 64, align: 64, offset: 512)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !169, file: !170, line: 256, baseType: !108, size: 64, align: 64, offset: 576)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !169, file: !170, line: 257, baseType: !108, size: 64, align: 64, offset: 640)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !169, file: !170, line: 258, baseType: !108, size: 64, align: 64, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !169, file: !170, line: 260, baseType: !185, size: 64, align: 64, offset: 768)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !170, line: 156, size: 192, align: 64, elements: !187)
!187 = !{!188, !189, !191}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !186, file: !170, line: 157, baseType: !185, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !186, file: !170, line: 158, baseType: !190, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !186, file: !170, line: 162, baseType: !14, size: 32, align: 32, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !169, file: !170, line: 262, baseType: !190, size: 64, align: 64, offset: 832)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !169, file: !170, line: 264, baseType: !14, size: 32, align: 32, offset: 896)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !169, file: !170, line: 268, baseType: !14, size: 32, align: 32, offset: 928)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !169, file: !170, line: 270, baseType: !196, size: 64, align: 64, offset: 960)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !197, line: 131, baseType: !198)
!197 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/cec/src/install")
!198 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !169, file: !170, line: 274, baseType: !200, size: 16, align: 16, offset: 1024)
!200 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !169, file: !170, line: 275, baseType: !202, size: 8, align: 8, offset: 1040)
!202 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !169, file: !170, line: 276, baseType: !204, size: 8, align: 8, offset: 1048)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 8, align: 8, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 1, lowerBound: 0)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !169, file: !170, line: 280, baseType: !208, size: 64, align: 64, offset: 1088)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !170, line: 150, baseType: null)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !169, file: !170, line: 289, baseType: !211, size: 64, align: 64, offset: 1152)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !197, line: 132, baseType: !198)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !169, file: !170, line: 297, baseType: !11, size: 64, align: 64, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !169, file: !170, line: 298, baseType: !11, size: 64, align: 64, offset: 1280)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !169, file: !170, line: 299, baseType: !11, size: 64, align: 64, offset: 1344)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !169, file: !170, line: 300, baseType: !11, size: 64, align: 64, offset: 1408)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !169, file: !170, line: 302, baseType: !217, size: 64, align: 64, offset: 1472)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !218, line: 62, baseType: !219)
!218 = !DIFile(filename: "/usr/lib/llvm-3.8/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/home/cec/src/install")
!219 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !169, file: !170, line: 303, baseType: !14, size: 32, align: 32, offset: 1536)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !169, file: !170, line: 305, baseType: !222, size: 160, align: 8, offset: 1568)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 160, align: 8, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 20, lowerBound: 0)
!225 = !DILocation(line: 144, column: 9, scope: !104)
!226 = !DILocation(line: 145, column: 13, scope: !227)
!227 = distinct !DILexicalBlock(scope: !104, file: !23, line: 145, column: 7)
!228 = !DILocation(line: 145, column: 11, scope: !227)
!229 = !DILocation(line: 145, column: 39, scope: !227)
!230 = !DILocation(line: 145, column: 7, scope: !104)
!231 = !DILocation(line: 146, column: 13, scope: !232)
!232 = distinct !DILexicalBlock(scope: !227, file: !23, line: 145, column: 54)
!233 = !DILocation(line: 147, column: 5, scope: !232)
!234 = !DILocation(line: 147, column: 16, scope: !232)
!235 = !DILocation(line: 148, column: 5, scope: !232)
!236 = !DILocation(line: 148, column: 16, scope: !232)
!237 = !DILocation(line: 149, column: 5, scope: !232)
!238 = !DILocation(line: 149, column: 16, scope: !232)
!239 = !DILocation(line: 150, column: 12, scope: !232)
!240 = !DILocation(line: 150, column: 5, scope: !232)
!241 = !DILocation(line: 151, column: 3, scope: !232)
!242 = !DILocation(line: 152, column: 13, scope: !243)
!243 = distinct !DILexicalBlock(scope: !227, file: !23, line: 151, column: 10)
!244 = !DILocation(line: 155, column: 3, scope: !104)
!245 = !DILocation(line: 157, column: 12, scope: !104)
!246 = !DILocation(line: 158, column: 11, scope: !104)
!247 = !DILocation(line: 159, column: 12, scope: !104)
!248 = !DILocation(line: 160, column: 11, scope: !104)
!249 = !DILocation(line: 172, column: 11, scope: !250)
!250 = distinct !DILexicalBlock(scope: !251, file: !23, line: 171, column: 68)
!251 = distinct !DILexicalBlock(scope: !252, file: !23, line: 171, column: 14)
!252 = distinct !DILexicalBlock(scope: !253, file: !23, line: 168, column: 14)
!253 = distinct !DILexicalBlock(scope: !254, file: !23, line: 165, column: 14)
!254 = distinct !DILexicalBlock(scope: !104, file: !23, line: 162, column: 7)
!255 = !DILocation(line: 173, column: 23, scope: !250)
!256 = !DILocation(line: 187, column: 3, scope: !104)
!257 = !DILocation(line: 188, column: 3, scope: !104)
!258 = !DILocation(line: 189, column: 3, scope: !104)
!259 = !DILocation(line: 190, column: 3, scope: !104)
!260 = !DILocation(line: 192, column: 7, scope: !104)
!261 = !DILocation(line: 193, column: 7, scope: !104)
!262 = !DILocation(line: 198, column: 8, scope: !104)
!263 = !DILocation(line: 199, column: 9, scope: !104)
!264 = !DILocation(line: 200, column: 24, scope: !104)
!265 = !DILocation(line: 200, column: 10, scope: !104)
!266 = !DILocation(line: 200, column: 8, scope: !104)
!267 = !DILocation(line: 205, column: 9, scope: !104)
!268 = !DILocation(line: 205, column: 14, scope: !104)
!269 = !DILocation(line: 206, column: 9, scope: !104)
!270 = !DILocation(line: 206, column: 19, scope: !104)
!271 = !DILocation(line: 206, column: 28, scope: !104)
!272 = !DILocation(line: 206, column: 38, scope: !104)
!273 = !DILocation(line: 205, column: 3, scope: !104)
!274 = !DILocation(line: 220, column: 10, scope: !275)
!275 = distinct !DILexicalBlock(scope: !104, file: !23, line: 220, column: 3)
!276 = !DILocation(line: 220, column: 8, scope: !275)
!277 = !DILocation(line: 220, column: 15, scope: !278)
!278 = distinct !DILexicalBlock(scope: !275, file: !23, line: 220, column: 3)
!279 = !DILocation(line: 220, column: 19, scope: !278)
!280 = !DILocation(line: 220, column: 29, scope: !278)
!281 = !DILocation(line: 220, column: 27, scope: !278)
!282 = !DILocation(line: 220, column: 38, scope: !278)
!283 = !DILocation(line: 220, column: 17, scope: !278)
!284 = !DILocation(line: 220, column: 3, scope: !275)
!285 = !DILocation(line: 221, column: 21, scope: !286)
!286 = distinct !DILexicalBlock(scope: !287, file: !23, line: 221, column: 5)
